{
    "tsTSName": "Name",
    "tsTSActions": "Aktionen",
    "tsrRulename": "Regelname",
    "tsrType": "Typ",
    "tsNewTimerule": "Neue Zeitregel",
    "tsNewTimeruleAdd": "Zeitregeln hinzufügen",
    "tsNewTimeruleDel": "Zeitregel del",
    "tsNewDatelistAdd": "Datumsliste hinzufügen",
    "tsNewDatelistDel": "Datumsliste del",
    "tsBack": "Zurück",
    "tsCancel": "Stornieren",
    "tsTimeserieAdd": "Zeitreihen hinzufügen",
    "tsActions": "Aktionen",
    "tsTimeserieEdit": "Zeitreihen bearbeiten",
    "tsTimeseriesName": "Name/Datenpunkt",
    "tsTimeseriesDuration": "Dauer",
    "tsEditRuleAdd": "Regeln bearbeiten – Hinzufügen",
    "tsEditRuleDel": "Regeln bearbeiten – Entf",
    "tsEditDateAdd": "Datumsliste bearbeiten – Hinzufügen",
    "tsEditDateDel": "Datumsliste bearbeiten - Entf",
    "tsBase": "Base",
    "tsExt1": "Ext.1",
    "tsExt2": "Ext.2",
    "Name of the rule.": "Name der Regel.",
    "name": "Name",
    "frequency": "Frequenz",
    "yearly": "jährlich",
    "monthly": "monatlich",
    "weekly": "wöchentlich",
    "daily": "täglich",
    "hourly": "stündlich",
    "minutely": "minutiös",
    "start date": "Startdatum",
    "until date": "bis Datum",
    "count": "zählen",
    "interval": "Intervall",
    "Monday": "Montag",
    "Tuesday": "Dienstag",
    "Wednsday": "Mittwoch",
    "Thursday": "Donnerstag",
    "Friday": "Freitag",
    "Saturday": "Samstag",
    "Sunday": "Sonntag",
    "January": "Januar",
    "February": "Februar",
    "March": "Marsch",
    "April": "April",
    "May": "Mai",
    "June": "Juni",
    "July": "Juli",
    "August": "August",
    "September": "September",
    "October": "Oktober",
    "November": "November",
    "December": "Dezember",
    "date": "Datum",
    "add": "Hinzufügen",
    "tsDate": "Datum",
    "weekstart": "Wochenstart",
    "byweekday": "bisWochentag",
    "bymonth": "nachMonat",
    "bysetpos": "bysetpos",
    "bymonthday": "vonMonatTag",
    "byyearday": "bisJahrtag",
    "byweekno": "byweeknr",
    "byhour": "pro Stunde",
    "byminute": "pro Minute",
    "tsNameTooltip": "Name der Regel.",
    "tsFreqTooltip": "Häufigkeit der Zeitreihe",
    "tsStartTooltip": "Der Beginn der Zeitreihe. Wenn nicht angegeben, werden das aktuelle Datum und die aktuelle Uhrzeit verwendet.",
    "tsUntilTooltip": "Dieser Zeitpunkt gibt die maximale Grenze dieser Zeitreihe an. Wenn die dazwischen berechneten Zeitpunkte genau diesen Zeitpunkt enthalten, dann ist dieser Zeitpunkt der letzte.",
    "tsCountTooltip": "Die Anzahl der berechneten Zeitpunkte",
    "tsIntervalTooltip": "Das Intervall jeder Wiederholung. Wenn Sie beispielsweise ein Intervall von 2 für eine jährliche Häufigkeit festlegen, werden die Zeitpunkte einmal alle 2 Jahre berechnet. Das Standardintervall ist 1.",
    "tsWeekstartTooltip": "Gibt den ersten Tag der Woche an. Dies betrifft Wiederholungen basierend auf wöchentlichen Zeiträumen.",
    "tsByweekdayTooltip": "Falls angegeben, können Sie auswählen, an welchen Wochentagen berechnete Zeiten gültig sind und in die Zeitreihe einbezogen werden. Wenn nicht angegeben, sind alle Wochentage gültig.",
    "tsBymonthTooltip": "Falls angegeben, können Sie auswählen, in welchen Monaten berechnete Zeitpunkte gültig sind und in die Zeitreihe einbezogen werden. Wenn nicht angegeben, sind alle Monate gültig.",
    "tsBysetposTooltip": "Hier kann entweder eine einzelne Ganzzahl angegeben werden oder eine durch Kommas getrennte Liste von Ganzzahlen angegeben werden. Dies kann genutzt werden, um anhand der Häufigkeit eine Abweichung zur berechneten Zeit zu generieren.<br>Wenn Sie beispielsweise eine <code>monatliche Häufigkeit</code> auswählen, alle <code>Arbeitstage Mo-Fr</code> auswählen und hier die Zahl -1 eingeben, wird eine Uhrzeit berechnet, die immer am letzten Werktag eines Monats liegt (Feiertage werden nicht berücksichtigt).",
    "tsBymonthdayTooltip": "Hier kann entweder eine einzelne Ganzzahl oder eine durch Kommas getrennte Liste von Ganzzahlen angegeben werden. Die Zahlen geben die für die Zeitreihenberechnung gültigen Tage des Monats an. Geben Sie beispielsweise 5 ein, werden nur die Zeitpunkte ausgegeben, die auf den 5. eines Monats fallen.",
    "tsByyeardayTooltip": "Hier kann entweder eine einzelne Ganzzahl oder eine durch Kommas getrennte Liste von Ganzzahlen angegeben werden. Die Zahlen geben die für die Zeitreihenberechnung gültigen Jahrestage an. Wenn Sie beispielsweise 180 eingeben, werden nur die Zeitpunkte ausgegeben, die auf den 180. Tag eines Jahres fallen.",
    "tsByweeknoTooltip": "Hier kann entweder eine einzelne Ganzzahl oder eine durch Kommas getrennte Liste von Ganzzahlen angegeben werden. Die Zahlen geben die Wochennummern an, die bei der Berechnung der Zeitreihe gültig sind. Wenn Sie beispielsweise 41 eingeben, werden nur die Zeitpunkte ausgegeben, die auf die 41. Woche eines Jahres fallen.",
    "tsByhourTooltip": "Hier kann entweder eine einzelne Ganzzahl oder eine durch Kommas getrennte Liste von Ganzzahlen angegeben werden. Die Zahlen geben die Stunde an, die bei der Berechnung der Zeitreihe gültig ist. Wenn Sie beispielsweise 9 eingeben, werden nur die Zeiten ausgegeben, die auf die 9. Stunde eines Tages fallen.",
    "tsByminuteTooltip": "Hier kann entweder eine einzelne Ganzzahl oder eine durch Kommas getrennte Liste von Ganzzahlen angegeben werden. Die Zahlen geben die Minute an, die bei der Berechnung der Zeitreihe gültig ist. Wenn Sie beispielsweise 15 eingeben, werden nur die Zeiten ausgegeben, die auf die 15. Minute einer Stunde fallen.",
    "tsTimeseriesNameTooltip": "Name der Zeitreihe.<br>Dieser Name wird als Datenpunkt erstellt.",
    "tsTimeseriesDurationTooltip": "Dauer des Triggers in Sekunden. Der Standardwert ist 1 Sekunde",
    "tsRuleAddTooltip": "Erstellen Sie eine neue Zeitreihe mit benutzerdefinierten Einstellungen, die die Zeitpunkte zur globalen Zeitreihe hinzufügen.",
    "tsRuleDelTooltip": "Erstellen Sie eine neue Zeitreihe mit benutzerdefinierten Einstellungen, die die Zeitpunkte aus der globalen Zeitreihe entfernen.",
    "tsDatelistAddTooltip": "Erstellen Sie eine neue Liste von Zeitpunkten, die der globalen Zeitreihe hinzugefügt werden sollen",
    "tsDatelistDelTooltip": "Erstellen Sie eine neue Liste von Zeitpunkten, die aus der globalen Zeitreihe entfernt werden sollen",
    "tsValidNotValid": "Muss eine gültige Nummer sein",
    "tsValidNotInteger": "Muss eine Ganzzahl sein",
    "tsValidNotGreaterThan1000000": "Muss größer als -1000000 sein",
    "tsValidNotGreaterThan0": "Muss größer als 0 sein",
    "tsValidNotLessThan": "Muss kleiner als 1.000.000 sein",
    "tsValidNotLessThan1000": "Muss kleiner als 1000 sein",
    "tsValidUniqueRulename": "Der Name der Regel muss eindeutig sein",
    "tsValidUniqueTimeseriesName": "Der Name der Zeitreihe muss eindeutig sein",
    "tsValidRange366": "Der Wert muss zwischen 1 und 366 und -366 und -1 liegen, ohne 0",
    "tsValidRange31": "Der Wert muss zwischen 1 und 31 und -31 und -1 liegen, ohne 0",
    "tsValidRange53": "Der Wert muss zwischen 1 und 53 und -53 und -1 liegen, ohne 0",
    "tsTableListEmpty": "Liste leer",
    "tsRule": "Regel",
    "tsActualDates": "Aktuelle Daten der Zeitreihe (max. 100 Einträge)",
    "tsDatelist": "Datumsliste",
    "tsValidLength": "Muss mindestens 1 Zeichen lang sein",
    "tsValidArrayLength": "Es muss mindestens ein Datum eingegeben werden.",
    "tsAstro": "Astro",
    "tsLatitudeTooltip": "Breitengrad für Astroberechnungen im Dezimalformat (z. B. 52,5200 für Berlin).",
    "tsLatitude": "Breite",
    "tsLongitudeTooltip": "Längengrad für Astroberechnungen im Dezimalformat (z. B. 13.4050 für Berlin).",
    "tsLongitude": "Länge",
    "tsSuntimesTooltip": "Aktivieren oder deaktivieren Sie die Berechnung der Astrozeiten für diese Zeitreihe. siehe https://suncalc.net/ als Referenz. Wenn Sie mehr als ein Datum auswählen, wird für jedes Datum ein Ereignis berechnet.",
    "tsSuntimes": "Sonnentermine",
    "tsAmateurDawn": "Amateur Dawn",
    "tsAmateurDawnTooltip": "Amateurastronomische Morgendämmerung (Sonne bei 12° vor Sonnenaufgang)",
    "tsAmateurDusk": "Amateur-Dämmerung",
    "tsAmateurDuskTooltip": "Amateurastronomische Dämmerung (Sonne bei 12° nach Sonnenaufgang)",
    "tsAstronomicalDawn": "Astronomische Morgendämmerung",
    "tsAstronomicalDawnTooltip": "Die Nacht endet (die astronomische Morgendämmerung beginnt)",
    "tsAstronomicalDusk": "Astronomische Dämmerung",
    "tsAstronomicalDuskTooltip": "Die Nacht beginnt (dunkel genug für astronomische Beobachtungen)",
    "tsBlueHourDawnEnd": "Ende der blauen Stunde im Morgengrauen",
    "tsBlueHourDawnEndTooltip": "Ende der Blauen Stunde (Ende der Zeit für besondere Fotofotos)",
    "tsBlueHourDawnStart": "Beginn der blauen Stunde im Morgengrauen",
    "tsBlueHourDawnStartTooltip": "Beginn der Blue Hour (die Zeit für besondere Fotofotos beginnt)",
    "tsBlueHourDuskEnd": "Ende der blauen Stunde in der Abenddämmerung",
    "tsBlueHourDuskEndTooltip": "Ende der Blauen Stunde (Ende der Zeit für besondere Fotofotos)",
    "tsBlueHourDuskStart": "Beginn der blauen Stunde in der Abenddämmerung",
    "tsBlueHourDuskStartTooltip": "Beginn der Blue Hour (die Zeit für besondere Fotofotos beginnt)",
    "tsCivilDawn": "Zivile Morgenröte",
    "tsCivilDawnTooltip": "Morgendämmerung (die morgendliche nautische Dämmerung endet, die morgendliche bürgerliche Dämmerung beginnt)",
    "tsCivilDusk": "Zivile Dämmerung",
    "tsCivilDuskTooltip": "Abenddämmerung (die nautische Abenddämmerung beginnt)",
    "tsGoldenHourDawnEnd": "Ende der goldenen Stunde im Morgengrauen",
    "tsGoldenHourDawnEndTooltip": "Die goldene Morgenstunde (sanftes Licht, beste Zeit zum Fotografieren) endet",
    "tsGoldenHourDawnStart": "Beginn der Goldenen Stunde im Morgengrauen",
    "tsGoldenHourDawnStartTooltip": "Die goldene Morgenstunde (sanftes Licht, beste Zeit zum Fotografieren) beginnt",
    "tsGoldenHourDuskEnd": "Goldene Stunde, Dämmerungsende",
    "tsGoldenHourDuskEndTooltip": "Die goldene Abendstunde (sanftes Licht, beste Zeit zum Fotografieren) endet",
    "tsGoldenHourDuskStart": "Beginn der Goldenen Stunde in der Abenddämmerung",
    "tsGoldenHourDuskStartTooltip": "Die goldene Abendstunde (sanftes Licht, beste Zeit zum Fotografieren) beginnt",
    "tsNadir": "Nadir",
    "tsNadirTooltip": "Nadir (dunkelster Moment der Nacht, Sonne steht am niedrigsten)",
    "tsNauticalDawn": "Nautische Morgendämmerung",
    "tsNauticalDawnTooltip": "Nautische Morgendämmerung (die morgendliche nautische Dämmerung beginnt)",
    "tsNauticalDusk": "Nautische Dämmerung",
    "tsNauticalDuskTooltip": "Ende der nautischen Dämmerung (abendliche astronomische Dämmerung beginnt)",
    "tsSolarNoon": "Sonnenmittag",
    "tsSolarNoonTooltip": "Sonnenmittag (Sonne steht am höchsten)",
    "tsSunriseEnd": "Ende des Sonnenaufgangs",
    "tsSunriseEndTooltip": "Der Sonnenaufgang endet (der untere Rand der Sonne berührt den Horizont)",
    "tsSunriseStart": "Sonnenaufgangsstart",
    "tsSunriseStartTooltip": "Sonnenaufgang beginnt (oberer Rand der Sonne erscheint am Horizont)",
    "tsSunsetEnd": "Ende des Sonnenuntergangs",
    "tsSunsetEndTooltip": "Der Sonnenuntergang endet (die Sonne verschwindet hinter dem Horizont, die Abenddämmerung beginnt)",
    "tsSunsetStart": "Beginn des Sonnenuntergangs",
    "tsSunsetStartTooltip": "Der Sonnenuntergang beginnt (Unterkante der Sonne berührt den Horizont)",
    "tsEmptycheckboxtooltip": "",
    "tsValidFreqSuntimes": "Sonnenzeitdaten können nur mit jährlicher, monatlicher, wöchentlicher oder täglicher Häufigkeit verwendet werden.",
    "tsValidFreqMoontimes": "Mondzeitdaten können nur mit jährlicher, monatlicher, wöchentlicher oder täglicher Häufigkeit verwendet werden.",
    "tsMoontimes": "Mondzeitdaten",
    "tsMoontimesTooltip": "Aktivieren oder deaktivieren Sie die Berechnung der Mondzeiten für diese Zeitreihe. Wenn Sie mehr als ein Datum auswählen, wird für jedes Datum ein Ereignis berechnet.",
    "tsMoonrise": "Mondaufgang",
    "tsMoonriseTooltip": "Mondaufgang (Zeitpunkt, wenn der Mond über dem Horizont erscheint)",
    "tsMoonhigh": "Mondhoch",
    "tsMoonhighTooltip": "Mondhoch (Zeitpunkt, wenn der Mond am höchsten steht)",
    "tsMoonset": "Monduntergang",
    "tsMoonsetTooltip": "Monduntergang (Zeitpunkt, wenn der Mond unter dem Horizont verschwindet)",
    "xxx": "xxx",
    "": ""
}