{
    "tsTSName": "Name",
    "tsTSActions": "Aktionen",
    "tsrRulename": "Regelname",
    "tsrType": "Typ",
    "tsNewTimerule": "Neue Zeitregel",
    "tsNewTimeruleAdd": "Zeitregel Add",
    "tsNewTimeruleDel": "Zeitregel Del",
    "tsNewDatelistAdd": "Datumsliste Add",
    "tsNewDatelistDel": "Datumsliste Del",
    "tsBack": "Zurück",
    "tsCancel": "Abbrechen",
    "tsTimeserieAdd": "Zeitreihe hinzufügen",
    "tsActions": "Aktionen",
    "tsTimeserieEdit": "Zeitreihe bearbeiten",
    "tsTimeseriesName": "Name/Datenpunkt",
    "tsTimeseriesDuration": "Dauer",
    "tsEditRuleAdd": "Zeitregel Add",
    "tsEditRuleDel": "Zeitregel Del",
    "tsEditDateAdd": "Datumsliste Add",
    "tsEditDateDel": "Datumsliste Del",
    "tsBase": "Basis",
    "tsExt1": "Ext.1",
    "tsExt2": "Ext.2",
    "Name of the rule.": "Name der Regel.",
    "name": "Name",
    "frequency": "frequency",
    "yearly": "jährlich",
    "monthly": "monatlich",
    "weekly": "wöchentlich",
    "daily": "täglich",
    "hourly": "stündlich",
    "minutely": "minütlich",
    "start date": "Startdatum",
    "until date": "Endedatum",
    "count": "Anzahl",
    "interval": "Intervall",
    "Monday": "Montag",
    "Tuesday": "Dienstag",
    "Wednsday": "Mittwoch",
    "Thursday": "Donnerstag",
    "Friday": "Freitag",
    "Saturday": "Samstag",
    "Sunday": "Sonntag",
    "January": "Januar",
    "February": "Februar",
    "March": "März",
    "April": "April",
    "May": "Mai",
    "June": "Juni",
    "July": "Juli",
    "August": "August",
    "September": "September",
    "October": "Oktober",
    "November": "November",
    "December": "Dezember",
    "date": "Datum",
    "add": "hinzufügen",
    "tsDate": "Datum",
    "weekstart": "weekstart",
    "byweekday": "byweekday",
    "bymonth": "bymonth",
    "bysetpos": "bysetpos",
    "bymonthday": "bymonthday",
    "byyearday": "byyearday",
    "byweekno": "byweekno",
    "byhour": "byhour",
    "byminute": "byminute",
    "tsNameTooltip": "Name der Vorschrift.",
    "tsFreqTooltip": "Häufigkeit der Zeitreihe",
    "tsStartTooltip": "Der Beginn der Zeitreihe. Wird er nicht angegeben, wird das aktuelle Datum und die aktuelle Uhrzeit verwendet.",
    "tsUntilTooltip": "Dieser Zeitpunkt gibt den maximalen Grenzwert dieser Zeitreihe an. Wenn die dazwischen berechneten Zeitpunkte genau diesen Zeitpunkt enthalten, dann ist dieser Zeitpunkt der letzte.",
    "tsCountTooltip": "Die Anzahl der berechneten Zeitpunkte",
    "tsIntervalTooltip": "Das Intervall der einzelnen Wiederholungen. Wenn Sie z. B. ein Intervall von 2 für eine jährliche Häufigkeit festlegen, werden die Zeitpunkte alle 2 Jahre einmal berechnet. Das Standardintervall ist 1.",
    "tsWeekstartTooltip": "Gibt den ersten Tag der Woche an. Dies wirkt sich auf Wiederholungen aus, die auf wöchentlichen Zeiträumen basieren.",
    "tsByweekdayTooltip": "Falls angegeben, können Sie wählen, an welchen Wochentagen die berechneten Zeiten gültig sind und in die Zeitreihe aufgenommen werden sollen. Wenn nicht angegeben, sind alle Wochentage gültig.",
    "tsBymonthTooltip": "Falls angegeben, können Sie wählen, in welchen Monaten berechnete Zeitpunkte gültig sind und in die Zeitreihe aufgenommen werden. Wenn nicht angegeben, sind alle Monate gültig.",
    "tsBysetposTooltip": "Hier kann entweder eine einzelne ganze Zahl angegeben werden oder eine Liste von ganzen Zahlen, die durch Kommas getrennt sind. Wenn Sie z.B. einen <code>monatlichen Rhythmus</code> wählen, alle <code>Arbeitstage Mo-Fr</code> auswählen und hier die Zahl -1 eingeben, wird eine Zeit berechnet, die immer am letzten Arbeitstag eines Monats liegt (Feiertage nicht berücksichtigt).",
    "tsBymonthdayTooltip": "Hier kann entweder eine einzelne Ganzzahl oder eine Liste von durch Kommata getrennten Ganzzahlen angegeben werden. Die Zahlen geben die Tage des Monats an, die für die Berechnung der Zeitreihe gültig sind.<brIst z.B. 5 angegeben, werden nur die Zeitpunkte ausgegeben, die auf den 5. eines Monats fallen.",
    "tsByyeardayTooltip": "Hier kann entweder eine einzelne ganze Zahl oder eine Liste von durch Kommata getrennten ganzen Zahlen angegeben werden. Die Zahlen geben die Jahrestage an, die für die Berechnung der Zeitreihe gültig sind.<br> Wenn Sie z.B. 180 eingeben, werden nur die Zeitpunkte ausgegeben, die auf den 180sten Tag eines Jahres fallen.",
    "tsByweeknoTooltip": "Hier kann entweder eine einzelne Ganzzahl oder eine Liste von durch Kommata getrennten Ganzzahlen angegeben werden. Die Zahlen geben die Wochennummern an, die bei der Berechnung der Zeitreihe gültig sind.<br> Wenn Sie z.B. 41 eingeben, werden nur die Zeitpunkte ausgegeben, die auf die 41ste Woche eines Jahres fallen.",
    "tsByhourTooltip": "Hier kann entweder eine einzelne Ganzzahl oder eine Liste von durch Kommata getrennten Ganzzahlen angegeben werden. Die Zahlen geben die Stunde an, die bei der Berechnung der Zeitreihe gültig ist.<brDie Eingabe von z.B. 9 bewirkt, dass nur die Zeiten ausgegeben werden, die auf die neunte Stunde eines Tages fallen.",
    "tsByminuteTooltip": "Hier kann entweder eine einzelne Ganzzahl oder eine Liste von durch Kommata getrennten Ganzzahlen angegeben werden. Die Zahlen geben die Minute an, die bei der Berechnung der Zeitreihe gültig ist.<brIst beispielsweise 15 angegeben, werden nur die Zeiten ausgegeben, die auf die 15.",
    "tsTimeseriesNameTooltip": "Name der Zeitserie<br>Dieser Name wird als Datenpunkt erstellt.",
    "tsTimeseriesDurationTooltip": "Dauer des Auslösers in Sekunden. Standard ist 1 Sekunde",
    "tsRuleAddTooltip": "Erstellen Sie eine neue Zeitreihe mit benutzerdefinierten Einstellungen, die die Zeitpunkte zur globalen Zeitreihe hinzufügen.",
    "tsRuleDelTooltip": "Erstellen Sie eine neue Zeitreihe mit benutzerdefinierten Einstellungen, die die Zeitpunkte aus der globalen Zeitreihe entfernen.",
    "tsDatelistAddTooltip": "Erstellen einer neuen Liste von Zeitpunkten, die der globalen Zeitreihe hinzugefügt werden sollen",
    "tsDatelistDelTooltip": "Erstellen einer neuen Liste von Zeitpunkten, die aus der globalen Zeitreihe entfernt werden sollen",
    "tsValidNotValid": "Muss eine gültige Nummer sein",
    "tsValidNotInteger": "Muss eine ganze Zahl sein",
    "tsValidNotGreaterThan1000000": "Muss größer als -1000000 sein",
    "tsValidNotGreaterThan0": "Muss größer als 0 sein",
    "tsValidNotLessThan": "Muss weniger als 1000000 betragen",
    "tsValidNotLessThan1000": "Muss weniger als 1000 betragen",
    "tsValidUniqueRulename": "Der Name der Regel muss eindeutig sein",
    "tsValidUniqueTimeseriesName": "Der Name der Zeitreihe muss eindeutig sein",
    "tsValidRange366": "Der Wert muss zwischen 1 bis 366 und -366 bis -1 liegen, ohne 0",
    "tsValidRange31": "Der Wert muss zwischen 1 bis 31 und -31 bis -1 liegen, ohne 0",
    "tsValidRange53": "Der Wert muss zwischen 1 bis 53 und -53 bis -1 liegen, ohne 0",
    "tsTableListEmpty": "Liste leer",
    "tsRule": "Regel",
    "tsActualDates": "Aktuelle Daten der Zeitreihe (max.100 Einträge)",
    "tsDatelist": "Datenliste",
    "tsValidLength": "Muss mindestens 1 Zeichen sein",
    "tsValidArrayLength": "Es muss mindestens ein Datum eingegeben werden.",
    "xxx": "xxx"
}