{
    "tsTSName": "Nombre",
    "tsTSActions": "Acciones",
    "tsrRulename": "Rulename",
    "tsrType": "Tipo",
    "tsNewTimerule": "Nueva Timerule",
    "tsNewTimeruleAdd": "Las normas temporales añaden",
    "tsNewTimeruleDel": "Regla temporal del",
    "tsNewDatelistAdd": "Añadir lista de fechas",
    "tsNewDatelistDel": "Lista de fechas del",
    "tsBack": "Volver",
    "tsCancel": "Cancelar",
    "tsTimeserieAdd": "Añadir Timeseries",
    "tsActions": "Acciones",
    "tsTimeserieEdit": "Editar Timeseries",
    "tsTimeseriesName": "Nombre/Punto de datos",
    "tsTimeseriesDuration": "Duración",
    "tsEditRuleAdd": "Editar reglas - Añadir",
    "tsEditRuleDel": "Editar reglas - Del",
    "tsEditDateAdd": "Editar lista de datos - Añadir",
    "tsEditDateDel": "Editar lista de datos - Del",
    "tsBase": "Base",
    "tsExt1": "Ext.1",
    "tsExt2": "Ext.2",
    "Name of the rule.": "Nombre de la norma.",
    "name": "Nombre",
    "frequency": "Frecuencia",
    "yearly": "anual",
    "monthly": "mensualmente",
    "weekly": "semanal",
    "daily": "diario",
    "hourly": "por hora",
    "minutely": "minuciosamente",
    "start date": "fecha de inicio",
    "until date": "hasta la fecha",
    "count": "cuente",
    "interval": "intervalo",
    "Monday": "Lunes",
    "Tuesday": "Martes",
    "Wednsday": "Miércoles",
    "Thursday": "Jueves",
    "Friday": "Viernes",
    "Saturday": "Sábado",
    "Sunday": "Domingo",
    "January": "Enero",
    "February": "Febrero",
    "March": "Marzo",
    "April": "Abril",
    "May": "Mayo",
    "June": "Junio",
    "July": "Julio",
    "August": "Agosto",
    "September": "Septiembre",
    "October": "Octubre",
    "November": "Noviembre",
    "December": "Diciembre",
    "date": "Fecha",
    "add": "Añadir",
    "tsDate": "Fecha",
    "weekstart": "weekstart",
    "byweekday": "byweekday",
    "bymonth": "bymonth",
    "bysetpos": "bysetpos",
    "bymonthday": "bymonthday",
    "byyearday": "byyearday",
    "byweekno": "byweekno",
    "byhour": "byhour",
    "byminute": "byminute",
    "tsNameTooltip": "Nombre de la norma.",
    "tsFreqTooltip": "Frecuencia de la serie temporal",
    "tsStartTooltip": "El inicio de la serie temporal. Si no se especifica, se utiliza la fecha y hora actuales.",
    "tsUntilTooltip": "Este punto en el tiempo indica el límite máximo de esta serie temporal. Si los puntos temporales calculados entre ellos contienen exactamente este punto temporal, entonces este punto temporal es el último.",
    "tsCountTooltip": "El número de puntos temporales calculados",
    "tsIntervalTooltip": "El intervalo de cada repetición. Por ejemplo, si establece un intervalo de 2 para una frecuencia anual, los puntos temporales se calcularán una vez cada 2 años. El intervalo por defecto es 1.",
    "tsWeekstartTooltip": "Especifica el primer día de la semana. Esto afecta a las recurrencias basadas en periodos de tiempo semanales.",
    "tsByweekdayTooltip": "Si se especifica, puede elegir en qué días de la semana son válidas las horas calculadas y se incluyen en la serie temporal. Si no se especifica, todos los días de la semana son válidos.",
    "tsBymonthTooltip": "Si se especifica, puede elegir en qué meses los puntos calculados en el tiempo son válidos y se incluyen en la serie temporal. Si no se especifica, todos los meses son válidos.",
    "tsBysetposTooltip": "Aquí se puede especificar un único número entero o una lista de números enteros separados por comas. Esto se puede utilizar para generar una desviación basada en la hora calculada en función de la frecuencia.<br>Por ejemplo, si selecciona una <code>frecuencia mensual</code>, selecciona todos los <code>días laborables de lunes a viernes</code> e introduce el número -1 aquí, se calculará una hora que siempre es el último día laborable de un mes (no se tienen en cuenta los días festivos).",
    "tsBymonthdayTooltip": "Aquí se puede especificar un único número entero o una lista de números enteros separados por comas. Los números indican los días del mes que son válidos a la hora de calcular las series temporales.<brSi se introduce 5, por ejemplo, sólo se emiten los puntos temporales que caen en el día 5 de un mes.",
    "tsByyeardayTooltip": "Aquí se puede especificar un único número entero o una lista de números enteros separados por comas. Los números indican los aniversarios que son válidos a la hora de calcular las series temporales.<brSi se introduce 180, por ejemplo, sólo se emiten los puntos temporales que caen en el día 180 de un año.",
    "tsByweeknoTooltip": "Aquí se puede especificar un único número entero o una lista de números enteros separados por comas. Los números indican los números de semana que son válidos al calcular las series temporales.<brSi se introduce 41, por ejemplo, sólo se emiten los puntos temporales que caen en la semana 41 de un año.",
    "tsByhourTooltip": "Aquí se puede especificar un único número entero o una lista de números enteros separados por comas. Los números indican la hora que es válida al calcular la serie temporal.<brSi se introduce 9, por ejemplo, sólo se emiten las horas que caen en la hora 9 de un día.",
    "tsByminuteTooltip": "Aquí se puede especificar un único número entero o una lista de números enteros separados por comas. Los números indican el minuto que es válido al calcular la serie temporal.<brSi se introduce 15, por ejemplo, sólo se emiten las horas que caen en el minuto 15 de una hora.",
    "tsTimeseriesNameTooltip": "Nombre del Timeserie.<br>Este Nombre se crea como datapoint.",
    "tsTimeseriesDurationTooltip": "Duración del disparo en segundos. Por defecto es 1 segundo",
    "tsRuleAddTooltip": "Cree una nueva serie temporal con ajustes personalizados que añadan los puntos temporales a la serie temporal global.",
    "tsRuleDelTooltip": "Cree una nueva serie temporal con ajustes personalizados que eliminen los puntos temporales de la serie temporal global.",
    "tsDatelistAddTooltip": "Crear una nueva lista de puntos temporales que se añadirán a la serie temporal global",
    "tsDatelistDelTooltip": "Crear una nueva lista de puntos temporales que se eliminarán de la serie temporal global",
    "tsValidNotValid": "Debe ser un número válido",
    "tsValidNotInteger": "Debe ser un número entero",
    "tsValidNotGreaterThan1000000": "Debe ser mayor que -1000000",
    "tsValidNotGreaterThan0": "Debe ser mayor que 0",
    "tsValidNotLessThan": "Debe ser inferior a 1000000",
    "tsValidNotLessThan1000": "Debe ser inferior a 1000",
    "tsValidUniqueRulename": "El nombre de la regla debe ser único",
    "tsValidUniqueTimeseriesName": "El nombre de la serie temporal debe ser único",
    "tsValidRange366": "El valor debe estar comprendido entre 1 y 366 y -366 y -1, sin 0",
    "tsValidRange31": "El valor debe estar comprendido entre 1 y 31 y -31 y -1, sin 0",
    "tsValidRange53": "El valor debe estar comprendido entre 1 y 53 y -53 y -1, sin 0",
    "tsTableListEmpty": "Lista vacía",
    "tsRule": "Regla",
    "tsActualDates": "Fechas reales de la serie temporal (máx.100 entradas)",
    "tsDatelist": "Lista de datos",
    "tsValidLength": "Debe tener al menos 1 carácter",
    "tsValidArrayLength": "Debe introducirse al menos una fecha.",
    "xxx": "xxx"
}