{
    "tsTSName": "Nom",
    "tsTSActions": "Actions",
    "tsrRulename": "Nom de la règle",
    "tsrType": "Type",
    "tsNewTimerule": "Nouveau timerule",
    "tsNewTimeruleAdd": "Les règles temporelles ajoutent",
    "tsNewTimeruleDel": "Règle du temps del",
    "tsNewDatelistAdd": "Ajout d'une liste de dates",
    "tsNewDatelistDel": "Liste de dates del",
    "tsBack": "Retour",
    "tsCancel": "Annuler",
    "tsTimeserieAdd": "Ajouter une série chronologique",
    "tsActions": "Actions",
    "tsTimeserieEdit": "Editer les séries chronologiques",
    "tsTimeseriesName": "Nom/Point de données",
    "tsTimeseriesDuration": "Durée de l'accord",
    "tsEditRuleAdd": "Modifier les règles - Ajouter",
    "tsEditRuleDel": "Modifier les règles - Del",
    "tsEditDateAdd": "Modifier la liste de données - Ajouter",
    "tsEditDateDel": "Editer la liste de données - Del",
    "tsBase": "Base",
    "tsExt1": "Ext.1",
    "tsExt2": "Ext.2",
    "Name of the rule.": "Nom de la règle.",
    "name": "Nom",
    "frequency": "Fréquence",
    "yearly": "annuellement",
    "monthly": "mensuel",
    "weekly": "hebdomadaire",
    "daily": "quotidien",
    "hourly": "horaire",
    "minutely": "minutieusement",
    "start date": "date de début",
    "until date": "jusqu'à la date",
    "count": "compter",
    "interval": "intervalle",
    "Monday": "Lundi",
    "Tuesday": "Mardi",
    "Wednsday": "Mercredi",
    "Thursday": "Jeudi",
    "Friday": "Vendredi",
    "Saturday": "Samedi",
    "Sunday": "Dimanche",
    "January": "Janvier",
    "February": "Février",
    "March": "Mars",
    "April": "Avril",
    "May": "Mai",
    "June": "Juin",
    "July": "Juillet",
    "August": "Août",
    "September": "Septembre",
    "October": "Octobre",
    "November": "Novembre",
    "December": "Décembre",
    "date": "Date",
    "add": "Ajouter",
    "tsDate": "Date",
    "weekstart": "weekstart",
    "byweekday": "byweekday",
    "bymonth": "bymonth",
    "bysetpos": "bysetpos",
    "bymonthday": "bymonthday",
    "byyearday": "byyearday",
    "byweekno": "byweekno",
    "byhour": "byhour",
    "byminute": "byminute",
    "tsNameTooltip": "Nom de la règle.",
    "tsFreqTooltip": "Fréquence de la série temporelle",
    "tsStartTooltip": "Le début de la série temporelle. Si elle n'est pas spécifiée, la date et l'heure actuelles sont utilisées.",
    "tsUntilTooltip": "Ce point dans le temps indique la limite maximale de cette série temporelle. Si les points dans le temps calculés entre les deux contiennent exactement ce point dans le temps, alors ce point dans le temps est le dernier.",
    "tsCountTooltip": "Le nombre de points de temps calculés",
    "tsIntervalTooltip": "L'intervalle de chaque répétition. Par exemple, si vous définissez un intervalle de 2 pour une fréquence annuelle, les points temporels seront calculés une fois tous les 2 ans. L'intervalle par défaut est de 1.",
    "tsWeekstartTooltip": "Spécifie le premier jour de la semaine. Cela affecte les récurrences basées sur des périodes hebdomadaires.",
    "tsByweekdayTooltip": "Si cette option est spécifiée, vous pouvez choisir les jours de la semaine où les heures calculées sont valables et incluses dans la série temporelle. Si vous ne le précisez pas, tous les jours de la semaine sont valables.",
    "tsBymonthTooltip": "Si cette option est spécifiée, vous pouvez choisir les mois au cours desquels les points calculés dans le temps sont valides et inclus dans la série temporelle. Si cette option n'est pas spécifiée, tous les mois sont valables.",
    "tsBysetposTooltip": "Un seul entier peut être spécifié ici ou une liste d'entiers séparés par des virgules peut être spécifiée. Par exemple, si vous sélectionnez une <code>fréquence mensuelle</code>, que vous sélectionnez tous les <code>jours ouvrables du lundi au vendredi</code> et que vous entrez le nombre -1 ici, une heure sera calculée qui correspond toujours au dernier jour ouvrable d'un mois (les jours fériés ne sont pas pris en compte).",
    "tsBymonthdayTooltip": "Il est possible de spécifier ici un seul nombre entier ou une liste de nombres entiers séparés par des virgules. Les nombres indiquent les jours du mois qui sont valables pour le calcul de la série temporelle. <br class='autobr' /> Si vous entrez 5, par exemple, seuls les points dans le temps qui tombent le 5 d'un mois sont édités.",
    "tsByyeardayTooltip": "Il est possible d'indiquer ici un seul nombre entier ou une liste de nombres entiers séparés par des virgules. Si vous entrez 180, par exemple, seuls les points dans le temps qui tombent le 180e jour d'une année sont édités.",
    "tsByweeknoTooltip": "Il est possible de spécifier un seul entier ou une liste d'entiers séparés par des virgules. Si vous entrez 41, par exemple, seuls les points dans le temps qui tombent sur la 41e semaine d'une année sont édités.",
    "tsByhourTooltip": "Il est possible de spécifier ici un seul nombre entier ou une liste de nombres entiers séparés par des virgules. Si vous entrez 9, par exemple, seules les heures qui tombent sur la 9e heure d'une journée sont éditées.",
    "tsByminuteTooltip": "Il est possible de spécifier ici un seul nombre entier ou une liste de nombres entiers séparés par des virgules. Si vous entrez 15, par exemple, seules les heures qui tombent sur la 15e minute d'une heure sont éditées.",
    "tsTimeseriesNameTooltip": "Nom de la Timeserie.<br>Ce nom est créé en tant que point de données.",
    "tsTimeseriesDurationTooltip": "Durée du déclenchement en secondes. La valeur par défaut est de 1 seconde",
    "tsRuleAddTooltip": "Créez une nouvelle série temporelle avec des paramètres personnalisés qui ajoutent les points temporels à la série temporelle globale.",
    "tsRuleDelTooltip": "Créez une nouvelle série temporelle avec des paramètres personnalisés qui suppriment les points temporels de la série temporelle globale.",
    "tsDatelistAddTooltip": "Créer une nouvelle liste de points temporels à ajouter à la série temporelle globale",
    "tsDatelistDelTooltip": "Créer une nouvelle liste de points temporels à retirer de la série temporelle globale",
    "tsValidNotValid": "Doit être un nombre valide",
    "tsValidNotInteger": "Doit être un nombre entier",
    "tsValidNotGreaterThan1000000": "Doit être supérieur à -1000000",
    "tsValidNotGreaterThan0": "Doit être supérieur à 0",
    "tsValidNotLessThan": "Doit être inférieur à 1000000",
    "tsValidNotLessThan1000": "Doit être inférieur à 1000",
    "tsValidUniqueRulename": "Le nom de la règle doit être unique",
    "tsValidUniqueTimeseriesName": "Le nom de la série temporelle doit être unique",
    "tsValidRange366": "La valeur doit être comprise entre 1 et 366 et entre -366 et -1, sans 0.",
    "tsValidRange31": "La valeur doit être comprise entre 1 et 31 et -31 et -1, sans 0.",
    "tsValidRange53": "La valeur doit être comprise entre 1 et 53 et -53 et -1, sans 0.",
    "tsTableListEmpty": "Liste vide",
    "tsRule": "Règle",
    "tsActualDates": "Dates réelles de la série chronologique (100 entrées maximum)",
    "tsDatelist": "Liste de données",
    "tsValidLength": "Doit être composé d'au moins 1 caractère",
    "tsValidArrayLength": "Au moins une date doit être saisie.",
    "xxx": "xxx"
}