{
    "tsTSName": "Nazwa",
    "tsTSActions": "Działania",
    "tsrRulename": "Rulename",
    "tsrType": "Typ",
    "tsNewTimerule": "Nowy moduł czasowy",
    "tsNewTimeruleAdd": "Zasady dotyczące czasu dodają",
    "tsNewTimeruleDel": "Reguła czasu del",
    "tsNewDatelistAdd": "Dodanie listy dat",
    "tsNewDatelistDel": "Lista dat del",
    "tsBack": "Powrót",
    "tsCancel": "Anuluj",
    "tsTimeserieAdd": "Dodaj Timeseries",
    "tsActions": "Działania",
    "tsTimeserieEdit": "Edytuj Timeseries",
    "tsTimeseriesName": "Nazwa/punkt danych",
    "tsTimeseriesDuration": "Czas trwania",
    "tsEditRuleAdd": "Edytuj reguły - Dodaj",
    "tsEditRuleDel": "Edytuj reguły - Del",
    "tsEditDateAdd": "Edytuj listę danych - Dodaj",
    "tsEditDateDel": "Edytuj listę danych - Del",
    "tsBase": "Podstawa",
    "tsExt1": "Ext.1",
    "tsExt2": "Ext.2",
    "Name of the rule.": "Nazwa reguły.",
    "name": "Nazwa",
    "frequency": "Częstotliwość",
    "yearly": "rocznie",
    "monthly": "miesięcznik",
    "weekly": "tygodnik",
    "daily": "codzienny",
    "hourly": "co godzinę",
    "minutely": "drobiazgowo",
    "start date": "data rozpoczęcia",
    "until date": "do daty",
    "count": "liczyć",
    "interval": "interwał",
    "Monday": "Poniedziałek",
    "Tuesday": "Wtorek",
    "Wednsday": "Środa",
    "Thursday": "Czwartek",
    "Friday": "Piątek",
    "Saturday": "Sobota",
    "Sunday": "Niedziela",
    "January": "Styczeń",
    "February": "Luty",
    "March": "Marzec",
    "April": "Kwiecień",
    "May": "Maj",
    "June": "Czerwiec",
    "July": "Lipiec",
    "August": "Sierpień",
    "September": "Wrzesień",
    "October": "Październik",
    "November": "Listopad",
    "December": "Grudzień",
    "date": "Data",
    "add": "Dodaj",
    "tsDate": "Data",
    "weekstart": "weekstart",
    "byweekday": "byweekday",
    "bymonth": "bymonth",
    "bysetpos": "bysetpos",
    "bymonthday": "bymonthday",
    "byyearday": "byyearday",
    "byweekno": "byweekno",
    "byhour": "byhour",
    "byminute": "byminute",
    "tsNameTooltip": "Nazwa reguły.",
    "tsFreqTooltip": "Częstotliwość szeregów czasowych",
    "tsStartTooltip": "Początek serii czasowej. Jeśli nie określono, używana jest bieżąca data i godzina.",
    "tsUntilTooltip": "Ten punkt w czasie wskazuje maksymalny limit tego szeregu czasowego. Jeśli punkty w czasie obliczone pomiędzy nimi zawierają dokładnie ten punkt w czasie, to ten punkt w czasie jest ostatnim.",
    "tsCountTooltip": "Liczba obliczonych punktów czasowych",
    "tsIntervalTooltip": "Interwał każdego powtórzenia. Na przykład, jeśli ustawisz interwał 2 dla częstotliwości rocznej, punkty czasowe będą obliczane raz na 2 lata. Domyślny interwał to 1.",
    "tsWeekstartTooltip": "Określa pierwszy dzień tygodnia. Ma to wpływ na nawroty oparte na tygodniowych okresach czasu.",
    "tsByweekdayTooltip": "Jeśli określono, można wybrać, w które dni tygodnia obliczone czasy są ważne i uwzględnione w szeregu czasowym. Jeśli nie określono, wszystkie dni tygodnia są ważne.",
    "tsBymonthTooltip": "Jeśli określono, można wybrać, w których miesiącach obliczone punkty w czasie są ważne i uwzględnione w szeregu czasowym. Jeśli nie określono, wszystkie miesiące są ważne.",
    "tsBysetposTooltip": "W tym miejscu można określić pojedynczą liczbę całkowitą lub listę liczb całkowitych oddzielonych przecinkami. Na przykład, jeśli wybierzesz <code>częstotliwość miesięczną</code>, wybierzesz wszystkie <code>dni robocze od poniedziałku do piątku</code> i wpiszesz tutaj liczbę -1, zostanie obliczony czas, który zawsze przypada na ostatni dzień roboczy miesiąca (święta państwowe nie są brane pod uwagę).",
    "tsBymonthdayTooltip": "Można tu podać pojedynczą liczbę całkowitą lub listę liczb całkowitych oddzielonych przecinkami. Liczby wskazują dni miesiąca, które są ważne podczas obliczania szeregu czasowego.<brJeśli wprowadzisz na przykład 5, wyprowadzane są tylko punkty w czasie, które przypadają na 5 dzień miesiąca.",
    "tsByyeardayTooltip": "Można tu podać pojedynczą liczbę całkowitą lub listę liczb całkowitych oddzielonych przecinkami. Liczby wskazują rocznice, które są ważne podczas obliczania szeregów czasowych.<br Jeśli wprowadzisz na przykład 180, wyprowadzane są tylko punkty w czasie, które przypadają na 180 dzień roku.",
    "tsByweeknoTooltip": "Można tu podać pojedynczą liczbę całkowitą lub listę liczb całkowitych oddzielonych przecinkami. Liczby wskazują numery tygodni, które są ważne podczas obliczania szeregów czasowych.<brJeśli wprowadzisz na przykład 41, wyprowadzane są tylko punkty w czasie, które przypadają na 41. tydzień roku.",
    "tsByhourTooltip": "Można tu podać pojedynczą liczbę całkowitą lub listę liczb całkowitych oddzielonych przecinkami. Liczby wskazują godzinę, która jest ważna podczas obliczania szeregu czasowego.<brJeśli wprowadzisz 9, na przykład, tylko czasy, które przypadają na 9 godzinę dnia są wyprowadzane.",
    "tsByminuteTooltip": "Można tu podać pojedynczą liczbę całkowitą lub listę liczb całkowitych oddzielonych przecinkami. Liczby wskazują minutę, która jest ważna podczas obliczania szeregu czasowego.<brJeśli wprowadzisz na przykład 15, wyprowadzane są tylko czasy, które przypadają na 15. minutę godziny.",
    "tsTimeseriesNameTooltip": "Nazwa Timeserie.<br>Ta nazwa jest tworzona jako punkt danych.",
    "tsTimeseriesDurationTooltip": "Czas trwania wyzwalacza w sekundach. Domyślnie 1 sekunda",
    "tsRuleAddTooltip": "Utwórz nową serię czasową z niestandardowymi ustawieniami, które dodadzą punkty czasowe do globalnej serii czasowej.",
    "tsRuleDelTooltip": "Utwórz nowy szereg czasowy z niestandardowymi ustawieniami, które usuwają punkty czasowe z globalnego szeregu czasowego.",
    "tsDatelistAddTooltip": "Utwórz nową listę punktów czasowych, które zostaną dodane do globalnej serii czasowej.",
    "tsDatelistDelTooltip": "Utworzenie nowej listy punktów czasowych, które mają zostać usunięte z globalnej serii czasowej.",
    "tsValidNotValid": "Musi to być prawidłowy numer",
    "tsValidNotInteger": "Musi być liczbą całkowitą",
    "tsValidNotGreaterThan1000000": "Musi być większa niż -1000000",
    "tsValidNotGreaterThan0": "Musi być większa niż 0",
    "tsValidNotLessThan": "Musi być mniejsza niż 1000000",
    "tsValidNotLessThan1000": "Musi być mniejsza niż 1000",
    "tsValidUniqueRulename": "Nazwa reguły musi być unikalna",
    "tsValidUniqueTimeseriesName": "Nazwa serii czasu musi być unikalna",
    "tsValidRange366": "Wartość musi zawierać się w przedziale od 1 do 366 i od -366 do -1, bez 0",
    "tsValidRange31": "Wartość musi zawierać się w przedziale od 1 do 31 i od -31 do -1, bez 0",
    "tsValidRange53": "Wartość musi zawierać się w przedziale od 1 do 53 i od -53 do -1, bez 0",
    "tsTableListEmpty": "Lista pusta",
    "tsRule": "Zasada",
    "tsActualDates": "Rzeczywiste daty szeregu czasowego (maks. 100 wpisów)",
    "tsDatelist": "Lista danych",
    "tsValidLength": "Musi mieć co najmniej 1 znak",
    "tsValidArrayLength": "Należy wprowadzić co najmniej jedną datę.",
    "xxx": "xxx"
}