{
    "tsTSName": "Nome",
    "tsTSActions": "Acções",
    "tsrRulename": "Nome da regra",
    "tsrType": "Tipo",
    "tsNewTimerule": "Nova tabela de temporização",
    "tsNewTimeruleAdd": "As regras temporais acrescentam",
    "tsNewTimeruleDel": "Regra temporal del",
    "tsNewDatelistAdd": "Adicionar lista de datas",
    "tsNewDatelistDel": "Lista de datas del",
    "tsBack": "Voltar",
    "tsCancel": "Cancelar",
    "tsTimeserieAdd": "Adicionar séries cronológicas",
    "tsActions": "Acções",
    "tsTimeserieEdit": "Editar séries cronológicas",
    "tsTimeseriesName": "Nome/Ponto de dados",
    "tsTimeseriesDuration": "Duração",
    "tsEditRuleAdd": "Editar regras - Adicionar",
    "tsEditRuleDel": "Editar regras - Del",
    "tsEditDateAdd": "Editar lista de dados - Adicionar",
    "tsEditDateDel": "Editar lista de dados - Del",
    "tsBase": "Base",
    "tsExt1": "Ext.1",
    "tsExt2": "Ext.2",
    "Name of the rule.": "Nome da regra.",
    "name": "Nome",
    "frequency": "Frequência",
    "yearly": "anual",
    "monthly": "mensal",
    "weekly": "semanal",
    "daily": "diário",
    "hourly": "por hora",
    "minutely": "minuciosamente",
    "start date": "data de início",
    "until date": "até à data",
    "count": "contagem",
    "interval": "intervalo",
    "Monday": "Segunda-feira",
    "Tuesday": "Terça-feira",
    "Wednsday": "Quarta-feira",
    "Thursday": "Quinta-feira",
    "Friday": "Sexta-feira",
    "Saturday": "Sábado",
    "Sunday": "Domingo",
    "January": "janeiro",
    "February": "fevereiro",
    "March": "março",
    "April": "abril",
    "May": "maio",
    "June": "junho",
    "July": "julho",
    "August": "agosto",
    "September": "setembro",
    "October": "outubro",
    "November": "novembro",
    "December": "dezembro",
    "date": "Data",
    "add": "Adicionar",
    "tsDate": "Data",
    "weekstart": "weekstart",
    "byweekday": "byweekday",
    "bymonth": "bymonth",
    "bysetpos": "bysetpos",
    "bymonthday": "bymonthday",
    "byyearday": "byyearday",
    "byweekno": "byweekno",
    "byhour": "byhour",
    "byminute": "byminute",
    "tsNameTooltip": "Nome da regra.",
    "tsFreqTooltip": "Frequência da série cronológica",
    "tsStartTooltip": "O início da série cronológica. Se não for especificado, é utilizada a data e hora actuais.",
    "tsUntilTooltip": "Este ponto no tempo indica o limite máximo desta série cronológica. Se os pontos no tempo calculados entre eles contiverem exatamente este ponto no tempo, então este ponto no tempo é o último.",
    "tsCountTooltip": "O número de pontos temporais calculados",
    "tsIntervalTooltip": "O intervalo de cada repetição. Por exemplo, se definir um intervalo de 2 para uma frequência anual, os pontos temporais serão calculados de 2 em 2 anos. O intervalo predefinido é 1.",
    "tsWeekstartTooltip": "Especifica o primeiro dia da semana. Isto afecta as recorrências baseadas em períodos de tempo semanais.",
    "tsByweekdayTooltip": "Se especificado, é possível escolher os dias da semana em que as horas calculadas são válidas e incluídas na série cronológica. Se não for especificado, todos os dias da semana são válidos.",
    "tsBymonthTooltip": "Se especificado, é possível escolher em que meses os pontos calculados no tempo são válidos e incluídos na série cronológica. Se não for especificado, todos os meses são válidos.",
    "tsBysetposTooltip": "Um único número inteiro pode ser especificado aqui ou uma lista de números inteiros separados por vírgulas pode ser especificada. Por exemplo, se selecionar uma <código>frequência mensal</code>, selecionar todos os <código>dias úteis de segunda a sexta-feira</code> e introduzir aqui o número -1, será calculada uma hora que corresponde sempre ao último dia útil de um mês (os feriados não são tidos em conta).",
    "tsBymonthdayTooltip": "Aqui pode ser especificado um único número inteiro ou uma lista de números inteiros separados por vírgulas. Os números indicam os dias do mês que são válidos para o cálculo da série cronológica.<brSe introduzir 5, por exemplo, só são emitidos os pontos no tempo que caem no dia 5 de um mês.",
    "tsByyeardayTooltip": "Aqui pode ser especificado um único número inteiro ou uma lista de números inteiros separados por vírgulas. Os números indicam os aniversários que são válidos ao calcular a série cronológica.<brSe introduzir 180, por exemplo, apenas os pontos no tempo que caem no 180º dia de um ano são emitidos.",
    "tsByweeknoTooltip": "Aqui pode ser especificado um único número inteiro ou uma lista de números inteiros separados por vírgulas. Os números indicam os números das semanas que são válidos para o cálculo da série cronológica.<brSe introduzir 41, por exemplo, só são emitidos os pontos no tempo que caem na 41ª semana de um ano.",
    "tsByhourTooltip": "Aqui pode ser especificado um único número inteiro ou uma lista de números inteiros separados por vírgulas. Os números indicam a hora que é válida para o cálculo da série cronológica.<brSe introduzir 9, por exemplo, só são emitidas as horas que caem na 9ª hora de um dia.",
    "tsByminuteTooltip": "Aqui pode ser especificado um único número inteiro ou uma lista de números inteiros separados por vírgulas. Os números indicam o minuto que é válido para o cálculo da série cronológica.<brSe introduzir 15, por exemplo, só são emitidas as horas que caem no 15º minuto de uma hora.",
    "tsTimeseriesNameTooltip": "Nome do Timeserie.<br>Este nome é criado como ponto de dados.",
    "tsTimeseriesDurationTooltip": "Duração do acionamento em segundos. A predefinição é 1 segundo",
    "tsRuleAddTooltip": "Crie uma nova série cronológica com definições personalizadas que adicionam os pontos temporais à série cronológica global.",
    "tsRuleDelTooltip": "Crie uma nova série cronológica com definições personalizadas que removem os pontos temporais da série cronológica global.",
    "tsDatelistAddTooltip": "Criar uma nova lista de pontos temporais a adicionar à série cronológica global",
    "tsDatelistDelTooltip": "Criar uma nova lista de pontos temporais a serem removidos da série cronológica global",
    "tsValidNotValid": "Deve ser um número válido",
    "tsValidNotInteger": "Deve ser um número inteiro",
    "tsValidNotGreaterThan1000000": "Deve ser superior a -1000000",
    "tsValidNotGreaterThan0": "Deve ser maior que 0",
    "tsValidNotLessThan": "Deve ser inferior a 1000000",
    "tsValidNotLessThan1000": "Deve ser inferior a 1000",
    "tsValidUniqueRulename": "O nome da regra deve ser único",
    "tsValidUniqueTimeseriesName": "O nome da série cronológica deve ser único",
    "tsValidRange366": "O valor deve estar compreendido entre 1 e 366 e -366 e -1, sem 0",
    "tsValidRange31": "O valor deve estar compreendido entre 1 e 31 e -31 e -1, sem 0",
    "tsValidRange53": "O valor deve estar compreendido entre 1 e 53 e -53 e -1, sem 0",
    "tsTableListEmpty": "Lista vazia",
    "tsRule": "Regra",
    "tsActualDates": "Datas reais da série cronológica (máx. 100 entradas)",
    "tsDatelist": "Lista de dados",
    "tsValidLength": "Deve ter pelo menos 1 carácter",
    "tsValidArrayLength": "Deve ser introduzida pelo menos uma data.",
    "xxx": "xxx"
}