{
    "tsTSName": "Имя",
    "tsTSActions": "Действия",
    "tsrRulename": "Rulename",
    "tsrType": "Тип",
    "tsNewTimerule": "Новый таймер",
    "tsNewTimeruleAdd": "Правила времени добавляют",
    "tsNewTimeruleDel": "Правило времени del",
    "tsNewDatelistAdd": "Добавление списка дат",
    "tsNewDatelistDel": "Список дат del",
    "tsBack": "Назад",
    "tsCancel": "Отмена",
    "tsTimeserieAdd": "Добавить временные серии",
    "tsActions": "Действия",
    "tsTimeserieEdit": "Редактировать временные серии",
    "tsTimeseriesName": "Имя/Точка данных",
    "tsTimeseriesDuration": "Продолжительность",
    "tsEditRuleAdd": "Редактировать правила - Добавить",
    "tsEditRuleDel": "Редактировать правила - Del",
    "tsEditDateAdd": "Редактировать список данных - Добавить",
    "tsEditDateDel": "Редактировать список данных - Del",
    "tsBase": "База",
    "tsExt1": "Ext.1",
    "tsExt2": "Ext.2",
    "Name of the rule.": "Название правила.",
    "name": "Имя",
    "frequency": "Частота",
    "yearly": "ежегодно",
    "monthly": "ежемесячно",
    "weekly": "Еженедельник",
    "daily": "ежедневно",
    "hourly": "почасовая",
    "minutely": "по мелочам",
    "start date": "дата начала",
    "until date": "до даты",
    "count": "считать",
    "interval": "интервал",
    "Monday": "Понедельник",
    "Tuesday": "Вторник",
    "Wednsday": "Wednsday",
    "Thursday": "Четверг",
    "Friday": "Пятница",
    "Saturday": "Суббота",
    "Sunday": "Воскресенье",
    "January": "Январь",
    "February": "Февраль",
    "March": "Март",
    "April": "Апрель",
    "May": "Май",
    "June": "Июнь",
    "July": "Июль",
    "August": "Август",
    "September": "Сентябрь",
    "October": "Октябрь",
    "November": "Ноябрь",
    "December": "Декабрь",
    "date": "Дата",
    "add": "Добавить",
    "tsDate": "Дата",
    "weekstart": "weekstart",
    "byweekday": "byweekday",
    "bymonth": "bymonth",
    "bysetpos": "bysetpos",
    "bymonthday": "bymonthday",
    "byyearday": "byyearday",
    "byweekno": "byweekno",
    "byhour": "byhour",
    "byminute": "byminute",
    "tsNameTooltip": "Название правила.",
    "tsFreqTooltip": "Частота временного ряда",
    "tsStartTooltip": "Начало временного ряда. Если не указано, используется текущая дата и время.",
    "tsUntilTooltip": "Эта точка времени указывает на максимальную границу данного временного ряда. Если точки времени, рассчитанные между ними, содержат именно эту точку времени, то эта точка времени является последней.",
    "tsCountTooltip": "Количество рассчитанных временных точек",
    "tsIntervalTooltip": "Интервал каждого повторения. Например, если вы установите интервал 2 для годовой частоты, временные точки будут рассчитываться раз в 2 года. Интервал по умолчанию равен 1.",
    "tsWeekstartTooltip": "Указывает первый день недели. Это влияет на повторы, основанные на недельных временных периодах.",
    "tsByweekdayTooltip": "Если указано, вы можете выбрать, в какие дни недели вычисленные времена действительны и включены во временной ряд. Если не указано, действительны все дни недели.",
    "tsBymonthTooltip": "Если указано, вы можете выбрать, в каких месяцах расчетные точки времени действительны и включены во временной ряд. Если не указано, действительными будут все месяцы.",
    "tsBysetposTooltip": "Здесь можно указать либо одно целое число, либо список целых чисел, разделенных запятыми. Это может быть использовано для создания отклонения от рассчитанного времени в зависимости от частоты.<br> Например, если вы выберете <code>месячную частоту</code>, выберете все <code>рабочие дни Mon-Fri</code> и введете здесь число -1, то будет рассчитано время, которое всегда приходится на последний рабочий день месяца (государственные праздники не учитываются).",
    "tsBymonthdayTooltip": "Здесь можно указать либо одно целое число, либо список целых чисел, разделенных запятыми. Числа указывают дни месяца, которые действительны при расчете временного ряда.<brЕсли вы укажете, например, 5, то будут выведены только те моменты времени, которые приходятся на 5 число месяца.",
    "tsByyeardayTooltip": "Здесь можно указать либо одно целое число, либо список целых чисел, разделенных запятыми. Числа указывают на годовщины, которые действительны при расчете временного ряда.<brЕсли вы укажете, например, 180, то будут выведены только те моменты времени, которые приходятся на 180-й день года.",
    "tsByweeknoTooltip": "Здесь можно указать либо одно целое число, либо список целых чисел, разделенных запятыми. Числа указывают на номера недель, которые действительны при расчете временного ряда.<brЕсли вы укажете, например, 41, то будут выведены только те моменты времени, которые приходятся на 41-ю неделю года.",
    "tsByhourTooltip": "Здесь можно указать либо одно целое число, либо список целых чисел, разделенных запятыми. Числа указывают на час, который используется при расчете временного ряда.<brЕсли вы укажете, например, 9, то будут выведены только те времена, которые приходятся на 9-й час дня.",
    "tsByminuteTooltip": "Здесь можно указать либо одно целое число, либо список целых чисел, разделенных запятыми. Числа указывают минуты, которые действительны при расчете временного ряда.<brЕсли вы укажете, например, 15, то будут выведены только те времена, которые приходятся на 15-ю минуту часа.",
    "tsTimeseriesNameTooltip": "Имя таймсерии.<br> Это имя создается как точка данных.",
    "tsTimeseriesDurationTooltip": "Длительность срабатывания в секундах. По умолчанию 1 секунда",
    "tsRuleAddTooltip": "Создайте новый временной ряд с пользовательскими настройками, которые добавят временные точки в глобальный временной ряд.",
    "tsRuleDelTooltip": "Создайте новый временной ряд с пользовательскими настройками, которые удаляют временные точки из глобального временного ряда.",
    "tsDatelistAddTooltip": "Создайте новый список временных точек для добавления в глобальный временной ряд",
    "tsDatelistDelTooltip": "Создайте новый список временных точек, которые будут удалены из глобального временного ряда",
    "tsValidNotValid": "Должно быть действительное число",
    "tsValidNotInteger": "Должно быть целым числом",
    "tsValidNotGreaterThan1000000": "Должно быть больше, чем -1000000",
    "tsValidNotGreaterThan0": "Должно быть больше 0",
    "tsValidNotLessThan": "Должно быть меньше 1000000",
    "tsValidNotLessThan1000": "Должно быть меньше 1000",
    "tsValidUniqueRulename": "Имя правила должно быть уникальным",
    "tsValidUniqueTimeseriesName": "Имя временной серии должно быть уникальным",
    "tsValidRange366": "Значение должно находиться в диапазоне от 1 до 366 и от -366 до -1, без 0",
    "tsValidRange31": "Значение должно находиться в диапазоне от 1 до 31 и от -31 до -1, без 0",
    "tsValidRange53": "Значение должно находиться в диапазоне от 1 до 53 и от -53 до -1, без 0",
    "tsTableListEmpty": "Список пуст",
    "tsRule": "Правило",
    "tsActualDates": "Фактические даты временной серии (не более 100 записей)",
    "tsDatelist": "Список данных",
    "tsValidLength": "Должно быть не менее 1 символа",
    "tsValidArrayLength": "Необходимо ввести хотя бы одну дату.",
    "xxx": "xxx"
}