{
    "tsTSName": "Name",
    "tsTSActions": "Actions",
    "tsrRulename": "Rulename",
    "tsrType": "Type",
    "tsNewTimerule": "New Timerule",
    "tsNewTimeruleAdd": "Time rules add",
    "tsNewTimeruleDel": "Time rule del",
    "tsNewDatelistAdd": "Date list add",
    "tsNewDatelistDel": "Date list del",
    "tsBack": "Back",
    "tsCancel": "Cancel",
    "tsTimeserieAdd": "Add Timeseries",
    "tsActions": "Actions",
    "tsTimeserieEdit": "Edit Timeseries",
    "tsTimeseriesName": "Name/Datapoint",
    "tsTimeseriesDuration": "Duration",
    "tsEditRuleAdd": "Edit Rules - Add",
    "tsEditRuleDel": "Edit Rules - Del",
    "tsEditDateAdd": "Edit Datelist - Add",
    "tsEditDateDel": "Edit Datelist - Del",
    "tsBase": "Base",
    "tsExt1": "Ext.1",
    "tsExt2": "Ext.2",
    "Name of the rule.": "Name of the rule.",
    "name": "Name",
    "frequency": "Frequency",
    "yearly": "yearly",
    "monthly": "monthly",
    "weekly": "weekly",
    "daily": "daily",
    "hourly": "hourly",
    "minutely": "minutely",
    "start date": "start date",
    "until date": "until date",
    "count": "count",
    "interval": "interval",
    "Monday": "Monday",
    "Tuesday": "Tuesday",
    "Wednsday": "Wednsday",
    "Thursday": "Thursday",
    "Friday": "Friday",
    "Saturday": "Saturday",
    "Sunday": "Sunday",
    "January": "January",
    "February": "February",
    "March": "March",
    "April": "April",
    "May": "May",
    "June": "June",
    "July": "July",
    "August": "August",
    "September": "September",
    "October": "October",
    "November": "November",
    "December": "December",
    "date": "Date",
    "add": "Add",
    "tsDate": "Date",
    "weekstart": "weekstart",
    "byweekday": "byweekday",
    "bymonth": "bymonth",
    "bysetpos": "bysetpos",
    "bymonthday": "bymonthday",
    "byyearday": "byyearday",
    "byweekno": "byweekno",
    "byhour": "byhour",
    "byminute": "byminute",
    "tsNameTooltip": "Name of the rule.",
    "tsFreqTooltip": "Frequency of the time series",
    "tsStartTooltip": "The start of the time series. If not specified, the current date and time is used.",
    "tsUntilTooltip": "This point in time indicates the maximum limit of this time series. If the points in time calculated in between contain exactly this point in time, then this point in time is the last one.",
    "tsCountTooltip": "The number of calculated time points",
    "tsIntervalTooltip": "The interval of each repetition. For example, if you set an interval of 2 for an annual frequency, the time points will be calculated once every 2 years. The default interval is 1.",
    "tsWeekstartTooltip": "Specifies the first day of the week. This affects recurrences based on weekly time periods.",
    "tsByweekdayTooltip": "If specified, you can choose on which days of the week calculated times are valid and included in the time series. If not specified, all days of the week are valid.",
    "tsBymonthTooltip": "If specified, you can choose in which months calculated points in time are valid and included in the time series. If not specified, all months are valid.",
    "tsBysetposTooltip": "Either a single integer can be specified here or a list of integers separated by commas can be specified. This can be used to generate a deviation based on the calculated time based on the frequency.<br>For example, if you select a <code>monthly frequency</code>, select all <code>working days Mon-Fri</code> and enter the number -1 here, a time will be calculated which is always on the last working day of a month (public holidays not taken into account).",
    "tsBymonthdayTooltip": "Either a single integer or a list of integers separated by commas can be specified here. The numbers indicate the days of the month that are valid when calculating the time series.<brIf you enter 5, for example, only the points in time that fall on the 5th of a month are output.",
    "tsByyeardayTooltip": "Either a single integer or a list of integers separated by commas can be specified here. The numbers indicate the anniversaries that are valid when calculating the time series.<brIf you enter 180, for example, only the points in time that fall on the 180th day of a year are output.",
    "tsByweeknoTooltip": "Either a single integer or a list of integers separated by commas can be specified here. The numbers indicate the week numbers that are valid when calculating the time series.<brIf you enter 41, for example, only the points in time that fall on the 41st week of a year are output.",
    "tsByhourTooltip": "Either a single integer or a list of integers separated by commas can be specified here. The numbers indicate the hour that is valid when calculating the time series.<brIf you enter 9, for example, only the times that fall on the 9th hour of a day are output.",
    "tsByminuteTooltip": "Either a single integer or a list of integers separated by commas can be specified here. The numbers indicate the minute that is valid when calculating the time series.<brIf you enter 15, for example, only the times that fall on the 15th minute of an hour are output.",
    "tsTimeseriesNameTooltip": "Name of the Timeserie.<br>This Name is created as datapoint.",
    "tsTimeseriesDurationTooltip": "Duration of the trigger in seconds. Default is 1 second",
    "tsRuleAddTooltip": "Create a new time series with custom settings that add the time points to the global time series.",
    "tsRuleDelTooltip": "Create a new time series with custom settings that remove the time points from the global time series.",
    "tsDatelistAddTooltip": "Create a new list of time points to be added to the global time series",
    "tsDatelistDelTooltip": "Create a new list of time points to be removed from the global time series",
    "tsValidNotValid": "Must be a valid number",
    "tsValidNotInteger": "Must be an integer",
    "tsValidNotGreaterThan1000000": "Must be greater than -1000000",
    "tsValidNotGreaterThan0": "Must be greater than 0",
    "tsValidNotLessThan": "Must be less than 1000000",
    "tsValidNotLessThan1000": "Must be less than 1000",
    "tsValidUniqueRulename": "The name of the rule must be unique",
    "tsValidUniqueTimeseriesName": "The Name of the timeseries must be unique",
    "tsValidRange366": "The value must be between 1 to 366 and -366 to -1, without 0",
    "tsValidRange31": "The value must be between 1 to 31 and -31 to -1, without 0",
    "tsValidRange53": "The value must be between 1 to 53 and -53 to -1, without 0",
    "tsTableListEmpty": "List empty",
    "tsRule": "Rule",
    "tsActualDates": "Actual Dates of the timeseries (max.100 entries)",
    "tsDatelist": "Datelist",
    "tsValidLength": "Must be at least 1 character",
    "tsValidArrayLength": "At least one date must be entered.",
    "xxx": "xxx"
}