{
    "test adapter settings": "Adaptereinstellungen für test", 
    "tabcountdown": "Countdown",
    "name": "Name",
    "days": "Tage",
    "hours": "Stunden",
    "mins": "Minuten",
    "secs": "Sekunden",
    "behaviour": "Verhalten",
    "set to timer": "Auf Timer setzen",
    "set to zero": "Auf Zero setzen",
    "actions": "Aktionen",
    "timer": "Auf Timer setzen",
    "zero": "Auf Zero setzen",
    "Adding Countdowns": "Countdown hinzufügen",
    "List Countdowns": "Liste der Countdowns",
    "": "",
    "New Timeserie": "Neue Timeserie",
    "tabtimeseries": "Timeseries",
    "Create a new Timeseries.": "Erstellen Sie eine neue Timeseries.",
    "Timeseries List": "Timeseries-Liste",
    "Timeseries": "Timeseries",
    "Actions": "Aktionen",
    "April": "April",
    "August": "August",
    "December": "Dezember",
    "Duration for switching the datapoint": "Dauer für das Umschalten des Datenpunkts",
    "February": "Februar",
    "Frequency": "Frequenz",
    "Friday": "Freitag",
    "How many occurrences will be generated.": "Wie viele Events werden generiert.",
    "If given, it must be either an integer, or a sequence of integers, meaning the hours to apply the recurrence to.": "Wenn angegeben, muss es entweder eine Ganzzahl oder eine Folge von Ganzzahlen sein, dh die Stunden, auf die die Wiederholung angewendet werden soll.",
    "If given, it must be either an integer, or a sequence of integers, meaning the minutes to apply the recurrence to.": "Wenn angegeben, muss es entweder eine Ganzzahl oder eine Folge von Ganzzahlen sein, dh die Minuten, auf die die Wiederholung angewendet werden soll.",
    "If given, it must be either an integer, or a sequence of integers, meaning the month days to apply the recurrence to.": "Wenn angegeben, muss es entweder eine Ganzzahl oder eine Folge von Ganzzahlen sein, dh die Monatstage, auf die die Wiederholung angewendet werden soll.",
    "If given, it must be either an integer, or a sequence of integers, meaning the week numbers to apply the recurrence to. Week numbers have the meaning described in ISO8601, that is, the first week of the year is that containing at least four days of the new year.": "Wenn angegeben, muss es entweder eine Ganzzahl oder eine Folge von Ganzzahlen sein, dh die Wochennummern, auf die die Wiederholung angewendet werden soll. ",
    "If given, it must be either an integer, or a sequence of integers, meaning the year days to apply the recurrence to.": "Wenn angegeben, muss es entweder eine Ganzzahl oder eine Folge von Ganzzahlen sein, dh die Jahrestage, auf die die Wiederholung angewendet werden soll.",
    "If given, it must be either an integer, or a sequence of integers, positive or negative. Each given integer will specify an occurrence number, corresponding to the nth occurrence of the rule inside the frequency period. For example, a <code>bysetpos</code> of <code>-1</code> if combined with a <code>MONTHLY</code> frequency, and a byweekday of ( <code>Monday</code>, <code>Tuesday</code>, <code>Wednsday</code>, <code>Thursday</code>, <code>Friday</code>), will result in the last work day of every month.": "Wenn angegeben, muss es entweder eine Ganzzahl oder eine Folge von Ganzzahlen sein, positiv oder negativ. Jede angegebene Ganzzahl gibt eine Vorkommensnummer an, die dem n-ten Vorkommen der Regel innerhalb der Frequenzperiode entspricht. Zum Beispiel ein <code>bysetpos</ code> von <code>-1</ code>, wenn es mit einer <code> MONATLICHEN </ code> Frequenz kombiniert wird, und ein byweekday von <code> Montag </ code>, <code> Dienstag </ code>, <code> Mittwoch </ code>, <code> Donnerstag </ code>, <code> Freitag </ code>) führt zum letzten Arbeitstag eines jeden Monats.",
    "If given, it must be either one of the given weekdays or a sequence of integeres (Monday == 0). When given, these values will define the weekdays where the recurrence will be applied. It's also possible to use an argument n for the weekday instances, which will mean the nth occurrence of this weekday in the period. ": "Wenn angegeben, muss es sich entweder um einen der angegebenen Wochentage oder um eine Folge von Ganzzahlen (Montag == 0) handeln. Wenn angegeben, definieren diese Werte die Wochentage, an denen die Wiederholung angewendet wird. Es ist auch möglich, ein Argument n für die Wochentagsinstanzen zu verwenden, was das n-te Auftreten dieses Wochentags in der Periode bedeutet.",
    "If given, it must be one of the given values or a sequence of integers, meaning the months to apply the recurrence to (January==1). ": "Wenn angegeben, muss es einer der angegebenen Werte oder eine Folge von Ganzzahlen sein, dh die Monate, auf die die Wiederholung angewendet werden soll (Januar == 1).",
    "If given, this must be a <code>Date</code> instance, that will specify the limit of the recurrence. If a recurrence instance happens to be the same as the <code>Date</code> instance given in the <code>until</code> argument, this will be the last occurrence.": "Wenn angegeben, muss dies eine Datum sein, die das Limit der Wiederholung angibt.",
    "January": "Januar",
    "July": "Juli",
    "June": "Juni",
    "List of Timerules": "Liste der Zeitregeln",
    "March": "März",
    "May": "Kann",
    "Monday": "Montag",
    "Name of the Timeseries. If empty a Number is used": "Name der Timeserie, wenn leer wird dieser künstlich erzeugt.",
    "Name of the rule. If empty a Number is used": "Name der Zeitegel. Wenn leer, wird dieser künstlich erzeugt.",
    "New Timerule": "Neue Zeitregel",
    "November": "November",
    "October": "Oktober",
    "Result (max. 100)": "Ergebnis (max. 100)",
    "Rulename": "Name der Zeitregel",
    "Saturday": "Samstag",
    "September": "September",
    "Specifying the first day of the week. This will affect recurrences based on weekly periods.": "Angabe des ersten Wochentags. ",
    "Sunday": "Sonntag",
    "The interval between each freq iteration. For example, when using <code>RRule.YEARLY</code>, an interval of <code>2</code> means once every two years, but with <code>RRule.HOURLY</code>, it means once every two hours. The default interval is <code>1</code>.": "Das Intervall zwischen jeder Frequenziteration. ",
    "The recurrence start. Besides being the base for the recurrence, missing parameters in the final recurrence instances will also be extracted from this date. If not given, <code>new Date</code> will be used instead.": "Die Wiederholung beginnt. ",
    "The timezone for the rule. If present, all recurrences will be interpreted as being in the local time of the given timezone. If not present, ": "Die Zeitzone für die Zeitregel. ",
    "Thursday": "Donnerstag",
    "Timerule": "Zeitregel",
    "Tuesday": "Dienstag",
    "Wednsday": "Mittwoch",
    "byhour": "byHour",
    "byminute": "byMinute",
    "bymonth": "byMonth",
    "bymonthday": "byMonthday",
    "bysetpos": "bySetpos",
    "byweekday": "byWeekday",
    "byweekno": "byWeekno",
    "byyearday": "byYearday",
    "count": "Anzahl",
    "daily": "täglich",
    "duration": "Dauer",
    "frequency": "Frequenz",
    "hourly": "stündlich",
    "interval": "Intervall",
    "minutely": "minütlich",
    "monthly": "monatlich",
    "start Date": "Anfangsdatum",
    "timeseries name": "Name der Timeserie",
    "timezone": "Zeitzone",
    "until Date": "Endedatum",
    "weekly": "wöchentlich",
    "weekstart": "Wochenstart",
    "yearly": "jährlich"
}