{
    "test adapter settings": "Ajustes del adaptador para test",
    "tabcountdown": "cuenta regresiva",
    "name": "Nombre",
    "days": "Dias",
    "hours": "Horas",
    "mins": "Minutos",
    "secs": "Segundos",
    "behaviour": "Comportamiento",
    "set to timer": "establecer en temporizador",
    "set to zero": "poner a cero",
    "actions": "comportamiento",
    "timer": "establecer en temporizador",
    "zero": "poner a cero",
    "Adding Countdowns": "Agregar cuentas regresivas",
    "List Countdowns": "Lista de cuentas regresivas",
    "New Timeserie": "Nueva serie temporal",
    "tabtimeseries": "Series de tiempo",
    "Create a new Timeseries.": "Crea una nueva serie temporal.",
    "Timeseries List": "Lista de series temporales",
    "Timeseries": "Series de tiempo",
    "Actions": "Comportamiento",
    "April": "abril",
    "August": "agosto",
    "December": "diciembre",
    "Duration for switching the datapoint": "Duración para cambiar el punto de datos",
    "February": "febrero",
    "Frequency": "Frecuencia",
    "Friday": "viernes",
    "How many occurrences will be generated.": "Cuántas ocurrencias se generarán.",
    "If given, it must be either an integer, or a sequence of integers, meaning the hours to apply the recurrence to.": "Si se da, debe ser un número entero o una secuencia de números enteros, es decir, las horas a las que aplicar la recurrencia.",
    "If given, it must be either an integer, or a sequence of integers, meaning the minutes to apply the recurrence to.": "Si se da, debe ser un número entero o una secuencia de números enteros, es decir, los minutos a los que aplicar la recurrencia.",
    "If given, it must be either an integer, or a sequence of integers, meaning the month days to apply the recurrence to.": "Si se da, debe ser un número entero o una secuencia de números enteros, es decir, los días del mes a los que se aplicará la recurrencia.",
    "If given, it must be either an integer, or a sequence of integers, meaning the week numbers to apply the recurrence to. Week numbers have the meaning described in ISO8601, that is, the first week of the year is that containing at least four days of the new year.": "Si se da, debe ser un número entero o una secuencia de números enteros, es decir, los números de la semana a los que aplicar la recurrencia. ",
    "If given, it must be either an integer, or a sequence of integers, meaning the year days to apply the recurrence to.": "Si se da, debe ser un número entero o una secuencia de números enteros, es decir, los días del año a los que se aplicará la recurrencia.",
    "If given, it must be either an integer, or a sequence of integers, positive or negative. Each given integer will specify an occurrence number, corresponding to the nth occurrence of the rule inside the frequency period. For example, a <code>bysetpos</code> of <code>-1</code> if combined with a <code>MONTHLY</code> frequency, and a byweekday of ( <code>Monday</code>, <code>Tuesday</code>, <code>Wednsday</code>, <code>Thursday</code>, <code>Friday</code>), will result in the last work day of every month.": "Si se da, debe ser un número entero o una secuencia de números enteros, positivos o negativos. ",
    "If given, it must be either one of the given weekdays or a sequence of integeres (Monday == 0). When given, these values will define the weekdays where the recurrence will be applied. It's also possible to use an argument n for the weekday instances, which will mean the nth occurrence of this weekday in the period. ": "Si se proporciona, debe ser uno de los días de la semana o una secuencia de números enteros (lunes == 0). ",
    "If given, it must be one of the given values or a sequence of integers, meaning the months to apply the recurrence to (January==1). ": "Si se da, debe ser uno de los valores dados o una secuencia de números enteros, es decir, los meses a los que aplicar la recurrencia (enero == 1).",
    "If given, this must be a <code>Date</code> instance, that will specify the limit of the recurrence. If a recurrence instance happens to be the same as the <code>Date</code> instance given in the <code>until</code> argument, this will be the last occurrence.": "Si se proporciona, debe ser una instancia de <code> Date </code>, que especificará el límite de la recurrencia. ",
    "January": "enero",
    "July": "julio",
    "June": "junio",
    "List of Timerules": "Lista de timerules",
    "March": "marzo",
    "May": "Mayo",
    "Monday": "lunes",
    "Name of the Timeseries. If empty a Number is used": "Nombre de la serie temporal. ",
    "Name of the rule. If empty a Number is used": "Nombre de la regla. ",
    "New Timerule": "Nuevo temporizador",
    "November": "noviembre",
    "October": "octubre",
    "Result (max. 100)": "Resultado (máx.100)",
    "Rulename": "Nombre de la regla",
    "Saturday": "sábado",
    "September": "septiembre",
    "Specifying the first day of the week. This will affect recurrences based on weekly periods.": "Especificando el primer día de la semana. ",
    "Sunday": "domingo",
    "The interval between each freq iteration. For example, when using <code>RRule.YEARLY</code>, an interval of <code>2</code> means once every two years, but with <code>RRule.HOURLY</code>, it means once every two hours. The default interval is <code>1</code>.": "El intervalo entre cada iteración de frecuencia. ",
    "The recurrence start. Besides being the base for the recurrence, missing parameters in the final recurrence instances will also be extracted from this date. If not given, <code>new Date</code> will be used instead.": "Comienza la recurrencia. ",
    "The timezone for the rule. If present, all recurrences will be interpreted as being in the local time of the given timezone. If not present, ": "La zona horaria de la regla. ",
    "Thursday": "jueves",
    "Tuesday": "martes",
    "Wednsday": "Miércoles",
    "byhour": "por hora",
    "byminute": "por minuto",
    "bymonth": "Por mes",
    "bymonthday": "por el lunes",
    "bysetpos": "porSetpos",
    "byweekday": "por Weekday",
    "byweekno": "porWeekno",
    "byyearday": "byYearday",
    "count": "Contar",
    "daily": "diario",
    "duration": "Duración",
    "frequency": "Frecuencia",
    "hourly": "cada hora",
    "interval": "Intervalo",
    "minutely": "minuciosamente",
    "monthly": "mensual",
    "timeseries name": "Nombre de la serie temporal",
    "timezone": "Zona horaria",
    "weekly": "semanal",
    "weekstart": "Weekstart",
    "yearly": "anual",
    "New adding time rule": "Nueva regla de tiempo de adición",
    "New deleting time rule": "Nueva regla de eliminación de tiempo",
    "New adding datelist": "Nuevo agregando datelist",
    "New deleting datelist": "Nueva lista de datos de eliminación",
    "Type": "Tipo",
    "Adding Timerule": "Añadiendo Timerule",
    "Deleting Timerule": "Eliminando Timerule",
    "Adding Dates": "Agregar fechas",
    "A date that you want to add to the List": "Una fecha que desea agregar a la lista",
    "Result": "Resultado",
    "Removing Dates": "Eliminación de fechas",
    "start date": "Fecha de inicio",
    "until date": "Hasta la fecha",
    "date": "Fecha",
    "dateadd": "AddDate",
    "datedel": "DelDate",
    "ruleadd": "AddRule",
    "ruledel": "DelRule"
}