{
    "test adapter settings": "Paramètres d'adaptateur pour test",
    "option1": "Option 1",
    "option2": "Option 2",
    "mytest": "Mon test",
    "tabcountdown": "Compte à rebours",
    "name": "Nom",
    "days": "Journées",
    "hours": "Heures",
    "mins": "Minutes",
    "secs": "Secondes",
    "behaviour": "Comportement",
    "": "",
    "set to timer": "réglé sur minuterie",
    "set to zero": "mis à zéro",
    "actions": "Actions",
    "timer": "réglé sur minuterie",
    "zero": "mis à zéro",
    "Adding Countdowns": "Ajout de comptes à rebours",
    "List Countdowns": "Liste des comptes à rebours",
    "New Timeserie": "New Timeserie",
    "tabtimeseries": "Des séries chronologiques",
    "Create a new Timeseries.": "Créez une nouvelle série temporelle.",
    "Timeseries List": "Liste des séries temporelles",
    "Timeseries": "Des séries chronologiques",
    "Actions": "Actions",
    "April": "avril",
    "August": "août",
    "December": "décembre",
    "Duration for switching the datapoint": "Durée de commutation du point de données",
    "February": "février",
    "Frequency": "La fréquence",
    "Friday": "Vendredi",
    "How many occurrences will be generated.": "Combien d'occurrences seront générées.",
    "If given, it must be either an integer, or a sequence of integers, meaning the hours to apply the recurrence to.": "S'il est donné, il doit s'agir d'un entier ou d'une séquence d'entiers, ce qui signifie les heures auxquelles appliquer la récurrence.",
    "If given, it must be either an integer, or a sequence of integers, meaning the minutes to apply the recurrence to.": "S'il est donné, il doit s'agir d'un entier ou d'une séquence d'entiers, c'est-à-dire les minutes auxquelles appliquer la récurrence.",
    "If given, it must be either an integer, or a sequence of integers, meaning the month days to apply the recurrence to.": "S'il est donné, il doit s'agir d'un entier ou d'une séquence d'entiers, c'est-à-dire les mois-jours auxquels appliquer la récurrence.",
    "If given, it must be either an integer, or a sequence of integers, meaning the week numbers to apply the recurrence to. Week numbers have the meaning described in ISO8601, that is, the first week of the year is that containing at least four days of the new year.": "S'il est donné, il doit s'agir d'un entier ou d'une séquence d'entiers, ce qui signifie les numéros de semaine auxquels appliquer la récurrence. ",
    "If given, it must be either an integer, or a sequence of integers, meaning the year days to apply the recurrence to.": "S'il est donné, il doit s'agir d'un entier ou d'une séquence d'entiers, ce qui signifie les jours de l'année auxquels appliquer la récurrence.",
    "If given, it must be either an integer, or a sequence of integers, positive or negative. Each given integer will specify an occurrence number, corresponding to the nth occurrence of the rule inside the frequency period. For example, a <code>bysetpos</code> of <code>-1</code> if combined with a <code>MONTHLY</code> frequency, and a byweekday of ( <code>Monday</code>, <code>Tuesday</code>, <code>Wednsday</code>, <code>Thursday</code>, <code>Friday</code>), will result in the last work day of every month.": "S'il est donné, il doit être soit un entier, soit une séquence d'entiers, positifs ou négatifs. ",
    "If given, it must be either one of the given weekdays or a sequence of integeres (Monday == 0). When given, these values will define the weekdays where the recurrence will be applied. It's also possible to use an argument n for the weekday instances, which will mean the nth occurrence of this weekday in the period. ": "S'il est donné, il doit être l'un des jours de la semaine donnés ou une séquence d'entiers (lundi == 0). ",
    "If given, it must be one of the given values or a sequence of integers, meaning the months to apply the recurrence to (January==1). ": "S'il est donné, il doit s'agir de l'une des valeurs données ou d'une séquence d'entiers, c'est-à-dire les mois auxquels appliquer la récurrence (janvier == 1).",
    "If given, this must be a <code>Date</code> instance, that will specify the limit of the recurrence. If a recurrence instance happens to be the same as the <code>Date</code> instance given in the <code>until</code> argument, this will be the last occurrence.": "S'il est donné, il doit s'agir d'une instance de <code> Date </code>, qui spécifiera la limite de la récurrence. ",
    "January": "janvier",
    "July": "juillet",
    "June": "juin",
    "List of Timerules": "Liste des Timerules",
    "March": "Mars",
    "May": "Peut",
    "Monday": "Lundi",
    "Name of the Timeseries. If empty a Number is used": "Nom de la série temporelle. ",
    "Name of the rule. If empty a Number is used": "Nom de la règle. ",
    "New Timerule": "Nouveau Timerule",
    "November": "novembre",
    "October": "octobre",
    "Result (max. 100)": "Résultat (max.100)",
    "Rulename": "Nom de règle",
    "Saturday": "samedi",
    "September": "septembre",
    "Specifying the first day of the week. This will affect recurrences based on weekly periods.": "Spécifier le premier jour de la semaine. ",
    "Sunday": "dimanche",
    "The interval between each freq iteration. For example, when using <code>RRule.YEARLY</code>, an interval of <code>2</code> means once every two years, but with <code>RRule.HOURLY</code>, it means once every two hours. The default interval is <code>1</code>.": "L'intervalle entre chaque itération de fréquence. ",
    "The recurrence start. Besides being the base for the recurrence, missing parameters in the final recurrence instances will also be extracted from this date. If not given, <code>new Date</code> will be used instead.": "La récurrence commence. ",
    "The timezone for the rule. If present, all recurrences will be interpreted as being in the local time of the given timezone. If not present, ": "Le fuseau horaire de la règle. ",
    "Thursday": "Jeudi",
    "Timerule": "Timerule",
    "Tuesday": "Mardi",
    "Wednsday": "Mercredi",
    "byhour": "byHour",
    "byminute": "byMinute",
    "bymonth": "par mois",
    "bymonthday": "parMonthday",
    "bysetpos": "parSetpos",
    "byweekday": "byWeekday",
    "byweekno": "parWeekno",
    "byyearday": "byYearday",
    "count": "Compter",
    "daily": "du quotidien",
    "duration": "Durée",
    "frequency": "La fréquence",
    "hourly": "horaire",
    "interval": "Intervalle",
    "minutely": "minutieusement",
    "monthly": "mensuel",
    "start Date": "Date de début",
    "timeseries name": "Nom de la série temporelle",
    "timezone": "Fuseau horaire",
    "until Date": "Jusqu'à la date",
    "weekly": "hebdomadaire",
    "weekstart": "Début de la semaine",
    "yearly": "annuel"
}