{
    "test adapter settings": "Impostazioni dell'adattatore per test",
    "tabcountdown": "Conto alla rovescia",
    "name": "Nome",
    "days": "Giorni",
    "hours": "Ore",
    "mins": "Minuti",
    "secs": "Secondi",
    "behaviour": "Comportamento",
    "set to timer": "impostato su timer",
    "set to zero": "impostato a zero",
    "actions": "Azioni",
    "timer": "impostato su timer",
    "zero": "impostato a zero",
    "Adding Countdowns": "Aggiunta di conti alla rovescia",
    "List Countdowns": "Elenco conti alla rovescia",
    "New Timeserie": "New Timeserie",
    "tabtimeseries": "Timeseries",
    "Create a new Timeseries.": "Crea una nuova serie temporale.",
    "Timeseries List": "Elenco delle serie temporali",
    "Timeseries": "Timeseries",
    "Actions": "Azioni",
    "April": "aprile",
    "August": "agosto",
    "December": "dicembre",
    "Duration for switching the datapoint": "Durata per la commutazione del datapoint",
    "February": "febbraio",
    "Frequency": "Frequenza",
    "Friday": "Venerdì",
    "How many occurrences will be generated.": "Quante occorrenze verranno generate.",
    "If given, it must be either an integer, or a sequence of integers, meaning the hours to apply the recurrence to.": "Se specificato, deve essere un numero intero o una sequenza di numeri interi, ovvero le ore a cui applicare la ricorrenza.",
    "If given, it must be either an integer, or a sequence of integers, meaning the minutes to apply the recurrence to.": "Se specificato, deve essere un numero intero o una sequenza di numeri interi, ovvero i minuti a cui applicare la ricorrenza.",
    "If given, it must be either an integer, or a sequence of integers, meaning the month days to apply the recurrence to.": "Se specificato, deve essere un numero intero o una sequenza di numeri interi, ovvero i giorni del mese a cui applicare la ricorrenza.",
    "If given, it must be either an integer, or a sequence of integers, meaning the week numbers to apply the recurrence to. Week numbers have the meaning described in ISO8601, that is, the first week of the year is that containing at least four days of the new year.": "Se specificato, deve essere un numero intero o una sequenza di numeri interi, ovvero i numeri della settimana a cui applicare la ricorrenza. ",
    "If given, it must be either an integer, or a sequence of integers, meaning the year days to apply the recurrence to.": "Se specificato, deve essere un numero intero o una sequenza di numeri interi, ovvero i giorni dell'anno a cui applicare la ricorrenza.",
    "If given, it must be either an integer, or a sequence of integers, positive or negative. Each given integer will specify an occurrence number, corresponding to the nth occurrence of the rule inside the frequency period. For example, a <code>bysetpos</code> of <code>-1</code> if combined with a <code>MONTHLY</code> frequency, and a byweekday of ( <code>Monday</code>, <code>Tuesday</code>, <code>Wednsday</code>, <code>Thursday</code>, <code>Friday</code>), will result in the last work day of every month.": "Se fornito, deve essere un numero intero o una sequenza di numeri interi, positivi o negativi. ",
    "If given, it must be either one of the given weekdays or a sequence of integeres (Monday == 0). When given, these values will define the weekdays where the recurrence will be applied. It's also possible to use an argument n for the weekday instances, which will mean the nth occurrence of this weekday in the period. ": "Se specificato, deve essere uno dei giorni della settimana indicati o una sequenza di numeri interi (lunedì == 0). ",
    "If given, it must be one of the given values or a sequence of integers, meaning the months to apply the recurrence to (January==1). ": "Se specificato, deve essere uno dei valori indicati o una sequenza di numeri interi, ovvero i mesi a cui applicare la ricorrenza (gennaio == 1).",
    "If given, this must be a <code>Date</code> instance, that will specify the limit of the recurrence. If a recurrence instance happens to be the same as the <code>Date</code> instance given in the <code>until</code> argument, this will be the last occurrence.": "Se specificato, deve essere un'istanza <code> Date </code>, che specificherà il limite di ricorrenza. ",
    "January": "gennaio",
    "July": "luglio",
    "June": "giugno",
    "List of Timerules": "Elenco dei timerules",
    "March": "marzo",
    "May": "Maggio",
    "Monday": "Lunedi",
    "Name of the Timeseries. If empty a Number is used": "Nome della serie temporale. ",
    "Name of the rule. If empty a Number is used": "Nome della regola. ",
    "New Timerule": "Nuovo timerule",
    "November": "novembre",
    "October": "ottobre",
    "Result (max. 100)": "Risultato (max.100)",
    "Rulename": "Rulename",
    "Saturday": "Sabato",
    "September": "settembre",
    "Specifying the first day of the week. This will affect recurrences based on weekly periods.": "Specificare il primo giorno della settimana. ",
    "Sunday": "Domenica",
    "The interval between each freq iteration. For example, when using <code>RRule.YEARLY</code>, an interval of <code>2</code> means once every two years, but with <code>RRule.HOURLY</code>, it means once every two hours. The default interval is <code>1</code>.": "L'intervallo tra ciascuna iterazione di frequenza. ",
    "The recurrence start. Besides being the base for the recurrence, missing parameters in the final recurrence instances will also be extracted from this date. If not given, <code>new Date</code> will be used instead.": "La ricorrenza inizia. ",
    "The timezone for the rule. If present, all recurrences will be interpreted as being in the local time of the given timezone. If not present, ": "Il fuso orario per la regola. ",
    "Thursday": "giovedi",
    "Tuesday": "martedì",
    "Wednsday": "Mercoledì",
    "byhour": "byHour",
    "byminute": "byMinute",
    "bymonth": "per mese",
    "bymonthday": "entro lunedì",
    "bysetpos": "bySetpos",
    "byweekday": "entroWeekday",
    "byweekno": "byWeekno",
    "byyearday": "entroYearday",
    "count": "Contare",
    "daily": "quotidiano",
    "duration": "Durata",
    "frequency": "Frequenza",
    "hourly": "ogni ora",
    "interval": "Intervallo",
    "minutely": "minuziosamente",
    "monthly": "mensile",
    "timeseries name": "Nome serie temporale",
    "timezone": "Fuso orario",
    "weekly": "settimanalmente",
    "weekstart": "Weekstart",
    "yearly": "annuale",
    "New adding time rule": "Nuova regola del tempo di aggiunta",
    "New deleting time rule": "Nuova regola del tempo di eliminazione",
    "New adding datelist": "Nuova aggiunta di datelist",
    "New deleting datelist": "Nuova cancellazione della lista dati",
    "Type": "genere",
    "Adding Timerule": "Aggiunta di timerule",
    "Deleting Timerule": "Eliminazione di Timerule",
    "Adding Dates": "Aggiunta di date",
    "A date that you want to add to the List": "Una data che desideri aggiungere all'elenco",
    "Result": "Risultato",
    "Removing Dates": "Rimozione delle date",
    "start date": "Data d'inizio",
    "until date": "Fino alla data",
    "date": "Data",
    "dateadd": "AddDate",
    "datedel": "DelDate",
    "ruleadd": "AddRule",
    "ruledel": "DelRule"
}