{
    "test adapter settings": "Ustawienia adaptera dla test",
    "tabcountdown": "Odliczanie",
    "name": "Nazwa",
    "days": "Dni",
    "hours": "godziny",
    "mins": "Minuty",
    "secs": "sekundy",
    "behaviour": "Zachowanie",
    "set to timer": "ustawiony na timer",
    "set to zero": "ustawione na zero",
    "actions": "działania",
    "timer": "ustawiony na timer",
    "zero": "ustawione na zero",
    "Adding Countdowns": "Dodawanie odliczania",
    "List Countdowns": "Lista odliczania",
    "New Timeserie": "New Timeserie",
    "tabtimeseries": "Szereg czasowy",
    "Create a new Timeseries.": "Utwórz nowy Timeseries.",
    "Timeseries List": "Lista Timeseries",
    "Timeseries": "Szereg czasowy",
    "Actions": "działania",
    "April": "kwiecień",
    "August": "sierpień",
    "December": "grudzień",
    "Duration for switching the datapoint": "Czas trwania zmiany punktu danych",
    "February": "luty",
    "Frequency": "Częstotliwość",
    "Friday": "piątek",
    "How many occurrences will be generated.": "Ile wystąpień zostanie wygenerowanych.",
    "If given, it must be either an integer, or a sequence of integers, meaning the hours to apply the recurrence to.": "Jeśli jest podana, musi to być liczba całkowita lub sekwencja liczb całkowitych, oznaczająca godziny, do których należy zastosować powtarzanie.",
    "If given, it must be either an integer, or a sequence of integers, meaning the minutes to apply the recurrence to.": "Jeśli jest podany, musi to być liczba całkowita lub sekwencja liczb całkowitych, oznaczająca minuty, do których należy zastosować powtarzanie.",
    "If given, it must be either an integer, or a sequence of integers, meaning the month days to apply the recurrence to.": "Jeśli jest podany, musi to być liczba całkowita lub sekwencja liczb całkowitych, co oznacza miesiąc dni, do których ma zostać zastosowany cykl.",
    "If given, it must be either an integer, or a sequence of integers, meaning the week numbers to apply the recurrence to. Week numbers have the meaning described in ISO8601, that is, the first week of the year is that containing at least four days of the new year.": "Jeśli jest podany, musi to być liczba całkowita lub sekwencja liczb całkowitych, oznaczająca numery tygodni, do których ma zostać zastosowane powtarzanie. ",
    "If given, it must be either an integer, or a sequence of integers, meaning the year days to apply the recurrence to.": "Jeśli jest podane, musi to być liczba całkowita lub sekwencja liczb całkowitych, oznaczająca dni roku, do których ma zostać zastosowana powtarzalność.",
    "If given, it must be either an integer, or a sequence of integers, positive or negative. Each given integer will specify an occurrence number, corresponding to the nth occurrence of the rule inside the frequency period. For example, a <code>bysetpos</code> of <code>-1</code> if combined with a <code>MONTHLY</code> frequency, and a byweekday of ( <code>Monday</code>, <code>Tuesday</code>, <code>Wednsday</code>, <code>Thursday</code>, <code>Friday</code>), will result in the last work day of every month.": "Jeśli podano, musi to być liczba całkowita lub sekwencja liczb całkowitych, dodatnia lub ujemna. ",
    "If given, it must be either one of the given weekdays or a sequence of integeres (Monday == 0). When given, these values will define the weekdays where the recurrence will be applied. It's also possible to use an argument n for the weekday instances, which will mean the nth occurrence of this weekday in the period. ": "Jeśli jest podany, musi to być jeden z podanych dni tygodnia lub sekwencja liczb całkowitych (poniedziałek == 0). ",
    "If given, it must be one of the given values or a sequence of integers, meaning the months to apply the recurrence to (January==1). ": "Jeśli jest podana, musi to być jedna z podanych wartości lub sekwencja liczb całkowitych, oznaczająca miesiące, do których należy zastosować powtarzanie (styczeń == 1).",
    "If given, this must be a <code>Date</code> instance, that will specify the limit of the recurrence. If a recurrence instance happens to be the same as the <code>Date</code> instance given in the <code>until</code> argument, this will be the last occurrence.": "Jeśli jest podane, musi to być instancja <code> Date </code>, która określa limit powtórzeń. ",
    "January": "styczeń",
    "July": "lipiec",
    "June": "czerwiec",
    "List of Timerules": "Lista timerów",
    "March": "Marsz",
    "May": "Może",
    "Monday": "poniedziałek",
    "Name of the Timeseries. If empty a Number is used": "Nazwa Timeseries. ",
    "Name of the rule. If empty a Number is used": "Nazwa reguły. ",
    "New Timerule": "Nowy harmonogram",
    "November": "listopad",
    "October": "październik",
    "Result (max. 100)": "Wynik (maks. 100)",
    "Rulename": "Rulename",
    "Saturday": "sobota",
    "September": "wrzesień",
    "Specifying the first day of the week. This will affect recurrences based on weekly periods.": "Określanie pierwszego dnia tygodnia. ",
    "Sunday": "niedziela",
    "The interval between each freq iteration. For example, when using <code>RRule.YEARLY</code>, an interval of <code>2</code> means once every two years, but with <code>RRule.HOURLY</code>, it means once every two hours. The default interval is <code>1</code>.": "Odstęp między każdą iteracją freq. ",
    "The recurrence start. Besides being the base for the recurrence, missing parameters in the final recurrence instances will also be extracted from this date. If not given, <code>new Date</code> will be used instead.": "Początek nawrotu. ",
    "The timezone for the rule. If present, all recurrences will be interpreted as being in the local time of the given timezone. If not present, ": "Strefa czasowa reguły. ",
    "Thursday": "czwartek",
    "Tuesday": "wtorek",
    "Wednsday": "Środa",
    "byhour": "byHour",
    "byminute": "byMinute",
    "bymonth": "byMonth",
    "bymonthday": "byMonthday",
    "bysetpos": "bySetpos",
    "byweekday": "byWeekday",
    "byweekno": "byWeekno",
    "byyearday": "byYearday",
    "count": "Liczyć",
    "daily": "codziennie",
    "duration": "Trwanie",
    "frequency": "Częstotliwość",
    "hourly": "cogodzinny",
    "interval": "Interwał",
    "minutely": "drobiazgowo",
    "monthly": "miesięczny",
    "timeseries name": "Nazwa Timeseries",
    "timezone": "Strefa czasowa",
    "weekly": "tygodniowo",
    "weekstart": "Weekstart",
    "yearly": "rocznie",
    "New adding time rule": "Nowa reguła czasu dodawania",
    "New deleting time rule": "Nowa reguła czasu kasowania",
    "New adding datelist": "Nowa lista danych dodawania",
    "New deleting datelist": "Nowa lista usuwania danych",
    "Type": "Rodzaj",
    "Adding Timerule": "Dodawanie harmonogramu",
    "Deleting Timerule": "Usuwanie harmonogramu",
    "Adding Dates": "Dodawanie dat",
    "A date that you want to add to the List": "Data, którą chcesz dodać do listy",
    "Result": "Wynik",
    "Removing Dates": "Usuwanie dat",
    "start date": "Data rozpoczęcia",
    "until date": "Do daty",
    "date": "Data",
    "dateadd": "AddDate",
    "datedel": "DelDate",
    "ruleadd": "AddRule",
    "ruledel": "DelRule"
}