{
    "test adapter settings": "Configurações do adaptador para test",
    "tabcountdown": "Contagem regressiva",
    "name": "Nome",
    "days": "Dias",
    "hours": "Horas",
    "mins": "Minutos",
    "secs": "Segundos",
    "behaviour": "Comportamento",
    "set to timer": "definir para cronômetro",
    "set to zero": "definido para zero",
    "actions": "ações",
    "timer": "definir para cronômetro",
    "zero": "definido para zero",
    "Adding Countdowns": "Adicionando contagens regressivas",
    "List Countdowns": "Listar contagens regressivas",
    "New Timeserie": "New Timeserie",
    "tabtimeseries": "Série do Tempo",
    "Create a new Timeseries.": "Crie uma nova série temporal.",
    "Timeseries List": "Lista de séries temporais",
    "Timeseries": "Série do Tempo",
    "Actions": "Ações",
    "April": "abril",
    "August": "agosto",
    "December": "dezembro",
    "Duration for switching the datapoint": "Duração para mudar o ponto de dados",
    "February": "fevereiro",
    "Frequency": "Frequência",
    "Friday": "Sexta-feira",
    "How many occurrences will be generated.": "Quantas ocorrências serão geradas.",
    "If given, it must be either an integer, or a sequence of integers, meaning the hours to apply the recurrence to.": "Se fornecido, deve ser um número inteiro ou uma sequência de números inteiros, significando as horas às quais aplicar a recorrência.",
    "If given, it must be either an integer, or a sequence of integers, meaning the minutes to apply the recurrence to.": "Se fornecido, deve ser um número inteiro ou uma sequência de números inteiros, significando os minutos aos quais aplicar a recorrência.",
    "If given, it must be either an integer, or a sequence of integers, meaning the month days to apply the recurrence to.": "Se fornecido, deve ser um número inteiro ou uma sequência de números inteiros, significando os dias do mês aos quais aplicar a recorrência.",
    "If given, it must be either an integer, or a sequence of integers, meaning the week numbers to apply the recurrence to. Week numbers have the meaning described in ISO8601, that is, the first week of the year is that containing at least four days of the new year.": "Se fornecido, deve ser um número inteiro ou uma sequência de inteiros, significando os números da semana aos quais aplicar a recorrência. ",
    "If given, it must be either an integer, or a sequence of integers, meaning the year days to apply the recurrence to.": "Se fornecido, deve ser um número inteiro ou uma sequência de números inteiros, significando os dias do ano aos quais aplicar a recorrência.",
    "If given, it must be either an integer, or a sequence of integers, positive or negative. Each given integer will specify an occurrence number, corresponding to the nth occurrence of the rule inside the frequency period. For example, a <code>bysetpos</code> of <code>-1</code> if combined with a <code>MONTHLY</code> frequency, and a byweekday of ( <code>Monday</code>, <code>Tuesday</code>, <code>Wednsday</code>, <code>Thursday</code>, <code>Friday</code>), will result in the last work day of every month.": "Se fornecido, deve ser um número inteiro ou uma sequência de números inteiros, positivo ou negativo. ",
    "If given, it must be either one of the given weekdays or a sequence of integeres (Monday == 0). When given, these values will define the weekdays where the recurrence will be applied. It's also possible to use an argument n for the weekday instances, which will mean the nth occurrence of this weekday in the period. ": "Se fornecido, deve ser um dos dias da semana fornecidos ou uma sequência de inteiros (segunda-feira == 0). ",
    "If given, it must be one of the given values or a sequence of integers, meaning the months to apply the recurrence to (January==1). ": "Se fornecido, deve ser um dos valores fornecidos ou uma sequência de inteiros, significando os meses aos quais aplicar a recorrência (janeiro == 1).",
    "If given, this must be a <code>Date</code> instance, that will specify the limit of the recurrence. If a recurrence instance happens to be the same as the <code>Date</code> instance given in the <code>until</code> argument, this will be the last occurrence.": "Se fornecido, deve ser uma instância de <code> Date </code>, que especificará o limite de recorrência. ",
    "January": "janeiro",
    "July": "Julho",
    "June": "Junho",
    "List of Timerules": "Lista de cronogramas",
    "March": "Março",
    "May": "Maio",
    "Monday": "Segunda-feira",
    "Name of the Timeseries. If empty a Number is used": "Nome da série do tempo. ",
    "Name of the rule. If empty a Number is used": "Nome da regra. ",
    "New Timerule": "Novo cronômetro",
    "November": "novembro",
    "October": "Outubro",
    "Result (max. 100)": "Resultado (máx. 100)",
    "Rulename": "Nome da regra",
    "Saturday": "sábado",
    "September": "setembro",
    "Specifying the first day of the week. This will affect recurrences based on weekly periods.": "Especificando o primeiro dia da semana. ",
    "Sunday": "Domigo",
    "The interval between each freq iteration. For example, when using <code>RRule.YEARLY</code>, an interval of <code>2</code> means once every two years, but with <code>RRule.HOURLY</code>, it means once every two hours. The default interval is <code>1</code>.": "O intervalo entre cada iteração de freq. ",
    "The recurrence start. Besides being the base for the recurrence, missing parameters in the final recurrence instances will also be extracted from this date. If not given, <code>new Date</code> will be used instead.": "O início da recorrência. ",
    "The timezone for the rule. If present, all recurrences will be interpreted as being in the local time of the given timezone. If not present, ": "O fuso horário da regra. ",
    "Thursday": "Quinta feira",
    "Tuesday": "terça",
    "Wednsday": "Quarta-feira",
    "byhour": "byHour",
    "byminute": "byMinute",
    "bymonth": "por mês",
    "bymonthday": "por mês",
    "bysetpos": "bySetpos",
    "byweekday": "por semana",
    "byweekno": "byWeekno",
    "byyearday": "por ano",
    "count": "Contagem",
    "daily": "diariamente",
    "duration": "Duração",
    "frequency": "Frequência",
    "hourly": "de hora em hora",
    "interval": "Intervalo",
    "minutely": "minuciosamente",
    "monthly": "por mês",
    "timeseries name": "Nome da série temporal",
    "timezone": "Fuso horário",
    "weekly": "semanal",
    "weekstart": "Weekstart",
    "yearly": "anual",
    "New adding time rule": "Nova regra de adição de tempo",
    "New deleting time rule": "Nova regra de exclusão de tempo",
    "New adding datelist": "Nova lista de dados adicionada",
    "New deleting datelist": "Nova lista de dados de exclusão",
    "Type": "Tipo",
    "Adding Timerule": "Adicionando Timerule",
    "Deleting Timerule": "Excluindo cronograma",
    "Adding Dates": "Adicionar datas",
    "A date that you want to add to the List": "Uma data que você deseja adicionar à lista",
    "Result": "Resultado",
    "Removing Dates": "Removendo datas",
    "start date": "Data de início",
    "until date": "Até a data",
    "date": "Encontro",
    "dateadd": "AddDate",
    "datedel": "DelDate",
    "ruleadd": "AddRule",
    "ruledel": "DelRule"
}